{"def": 0, "find_cuda_init": 1, "fn": 2, "callable": 3, "object": 4, "none": 5, "helper": 6, "function": 7, "debug": 8, "cuda": 9, "re": 10, "initialization": 11, "errors": 12, "initializes": 13, "prints": 14, "stack": 15, "trace": 16, "how": 17, "happens": 18, "from": 19, "torch": 20, "import": 21, "_lazy_init": 22, "wrapper": 23, "nonlocal": 24, "traceback": 25, "extract_stack": 26, "return": 27, "patch": 28, "print": 29, "initialized": 30, "join": 31, "format_list": 32, "strip": 33, "find": 34, "init": 35, "lazy": 36, "extract": 37, "format": 38, "list": 39, "load_module_from_path": 40, "module_name": 41, "path": 42, "spec": 43, "importlib": 44, "util": 45, "spec_from_file_location": 46, "module": 47, "module_from_spec": 48, "sys": 49, "modules": 50, "loader": 51, "exec_module": 52, "load": 53, "name": 54, "file": 55, "location": 56, "exec": 57, "is_sccache_available": 58, "bool": 59, "which": 60, "sccache": 61, "int": 62, "os": 63, "getenv": 64, "vllm_disable_sccache": 65, "available": 66, "vllm": 67, "disable": 68, "is_ccache_available": 69, "ccache": 70, "is_ninja_available": 71, "ninja": 72, "is_url_available": 73, "url": 74, "str": 75, "urllib": 76, "request": 77, "urlopen": 78, "status": 79, "try": 80, "except": 81, "exception": 82, "false": 83, "200": 84, "class": 85, "cmakeextension": 86, "extension": 87, "__init__": 88, "self": 89, "cmake_lists_dir": 90, "kwa": 91, "super": 92, "sources": 93, "py_limited_api": 94, "true": 95, "abspath": 96, "make": 97, "cmake": 98, "lists": 99, "dir": 100, "py": 101, "limited": 102, "api": 103, "cmake_build_ext": 104, "build_ext": 105, "dict": 106, "directories": 107, "have": 108, "been": 109, "configured": 110, "did_config": 111, "determine": 112, "number": 113, "compilation": 114, "jobs": 115, "optionally": 116, "nvcc": 117, "compile": 118, "threads": 119, "compute_num_jobs": 120, "num_jobs": 121, "either": 122, "value": 123, "max_jobs": 124, "environment": 125, "variable": 126, "defined": 127, "cpus": 128, "envs": 129, "logger": 130, "info": 131, "using": 132, "else": 133, "sched_getaffinity": 134, "isn": 135, "universally": 136, "so": 137, "fall": 138, "back": 139, "cpu_count": 140, "we": 141, "get": 142, "error": 143, "here": 144, "len": 145, "attributeerror": 146, "nvcc_threads": 147, "_is_cuda": 148, "get_nvcc_cuda_version": 149, "version": 150, "11": 151, "when": 152, "set": 153, "reduce": 154, "avoid": 155, "overloading": 156, "system": 157, "max": 158, "perform": 159, "configuration": 160, "single": 161, "configure": 162, "ext": 163, "ve": 164, "already": 165, "cmakelists": 166, "txt": 167, "exit": 168, "early": 169, "build": 170, "did": 171, "config": 172, "compute": 173, "num": 174, "sched": 175, "getaffinity": 176, "cpu": 177, "count": 178, "attribute": 179, "select": 180, "type": 181, "note": 182, "optimization": 183, "level": 184, "default_cfg": 185, "relwithdebinfo": 186, "cfg": 187, "cmake_build_type": 188, "cmake_args": 189, "dcmake_build_type": 190, "dvllm_target_device": 191, "vllm_target_device": 192, "verbose": 193, "dcmake_verbose_makefile": 194, "dcmake_c_compiler_launcher": 195, "dcmake_cxx_compiler_launcher": 196, "dcmake_cuda_compiler_launcher": 197, "dcmake_hip_compiler_launcher": 198, "elif": 199, "pass": 200, "python": 201, "executable": 202, "can": 203, "exact": 204, "match": 205, "dvllm_python_executable": 206, "reuse": 207, "dependencies": 208, "subsequent": 209, "calls": 210, "dvllm_python_path": 211, "override": 212, "base": 213, "directory": 214, "fetchcontent": 215, "downloads": 216, "root": 217, "deps": 218, "allows": 219, "sharing": 220, "between": 221, "profiles": 222, "plays": 223, "more": 224, "nicely": 225, "fetchcontent_base_dir": 226, "fc_base_dir": 227, "root_dir": 228, "environ": 229, "dfetchcontent_base_dir": 230, "setup": 231, "parallelism": 232, "tool": 233, "default": 234, "rel": 235, "deb": 236, "args": 237, "dcmake": 238, "dvllm": 239, "target": 240, "device": 241, "makefile": 242, "compiler": 243, "launcher": 244, "cxx": 245, "hip": 246, "fetch": 247, "content": 248, "fc": 249, "dfetchcontent": 250, "dnvcc_threads": 251, "build_tool": 252, "dcmake_job_pool_compile": 253, "string": 254, "dcmake_job_pools": 255, "whatever": 256, "picks": 257, "sure": 258, "use": 259, "cuda_home": 260, "dcmake_cuda_compiler": 261, "bin": 262, "subprocess": 263, "check_call": 264, "cwd": 265, "build_temp": 266, "build_extensions": 267, "ensure": 268, "present": 269, "working": 270, "check_output": 271, "oserror": 272, "raise": 273, "runtimeerror": 274, "cannot": 275, "create": 276, "does": 277, "exist": 278, "exists": 279, "makedirs": 280, "targets": 281, "target_name": 282, "removeprefix": 283, "vllm_flash_attn": 284, "all": 285, "extensions": 286, "append": 287, "build_args": 288, "install": 289, "libraries": 290, "proper": 291, "outdir": 292, "get_ext_fullpath": 293, "parent": 294, "absolute": 295, "dnvcc": 296, "job": 297, "pool": 298, "pools": 299, "home": 300, "check": 301, "call": 302, "temp": 303, "output": 304, "runtime": 305, "flash": 306, "attn": 307, "fullpath": 308, "skip": 309, "same": 310, "continue": 311, "appends": 312, "prefix": 313, "contains": 314, "need": 315, "remove": 316, "range": 317, "should": 318, "actually": 319, "components": 320, "install_args": 321, "component": 322, "run": 323, "first": 324, "standard": 325, "command": 326, "copy": 327, "build_lib": 328, "current": 329, "included": 330, "editable": 331, "glob": 332, "files": 333, "recursive": 334, "dst_file": 335, "split": 336, "copying": 337, "dirname": 338, "exist_ok": 339, "copy_file": 340, "lib": 341, "dst": 342, "ok": 343, "precompiled_build_ext": 344, "disables": 345, "building": 346, "precompiled": 347, "binaries": 348, "assert": 349, "vllm_use_precompiled": 350, "only": 351, "supported": 352, "builds": 353, "skipping": 354, "precompiled_wheel_utils": 355, "extracts": 356, "other": 357, "existing": 358, "wheel": 359, "staticmethod": 360, "extract_precompiled_and_patch_package": 361, "wheel_url_or_path": 362, "tempfile": 363, "zipfile": 364, "temp_dir": 365, "isfile": 366, "wheel_filename": 367, "mkdtemp": 368, "wheels": 369, "wheel_path": 370, "downloading": 371, "urlretrieve": 372, "filename": 373, "package_data_patch": 374, "files_to_copy": 375, "_c": 376, "abi3": 377, "_moe_c": 378, "_flashmla_c": 379, "_vllm_fa2_c": 380, "_vllm_fa3_c": 381, "cumem_allocator": 382, "compiled_regex": 383, "file_members": 384, "filter": 385, "lambda": 386, "filelist": 387, "target_path": 388, "utils": 389, "package": 390, "data": 391, "zip": 392, "moe": 393, "flashmla": 394, "fa2": 395, "fa3": 396, "cumem": 397, "allocator": 398, "compiled": 399, "regex": 400, "members": 401, "open": 402, "src": 403, "wb": 404, "shutil": 405, "copyfileobj": 406, "pkg": 407, "replace": 408, "setdefault": 409, "basename": 410, "finally": 411, "removing": 412, "temporary": 413, "rmtree": 414, "get_base_commit_in_main_branch": 415, "force": 416, "nightly": 417, "mainly": 418, "used": 419, "ci": 420, "testing": 421, "vllm_test_use_precompiled_nightly_wheel": 422, "latest": 423, "commit": 424, "hash": 425, "upstream": 426, "main": 427, "branch": 428, "resp_json": 429, "curl": 430, "https": 431, "github": 432, "com": 433, "repos": 434, "project": 435, "commits": 436, "decode": 437, "utf": 438, "upstream_main_commit": 439, "json": 440, "loads": 441, "sha": 442, "docker": 443, "context": 444, "git": 445, "may": 446, "immutable": 447, "missing": 448, "vllm_docker_build_context": 449, "local": 450, "repo": 451, "cat": 452, "calledprocesserror": 453, "remote": 454, "repository": 455, "update": 456, "any": 457, "branches": 458, "ensures": 459, "ref": 460, "its": 461, "history": 462, "our": 463, "test": 464, "resp": 465, "called": 466, "process": 467, "current_branch": 468, "show": 469, "base_commit": 470, "merge": 471, "valueerror": 472, "err": 473, "warning": 474, "failed": 475, "compatible": 476, "your": 477, "dev": 478, "_no_device": 479, "empty": 480, "has_cuda": 481, "_is_neuron": 482, "_is_tpu": 483, "has": 484, "neuron": 485, "tpu": 486, "_is_hip": 487, "rocm": 488, "_is_cpu": 489, "_is_xpu": 490, "xpu": 491, "_build_custom_ops": 492, "custom": 493, "ops": 494, "get_rocm_version": 495, "rocm_home": 496, "librocm": 497, "core": 498, "see": 499, "blob": 500, "d11f5c20d500f729c393680a01fa902ebf92094b": 501, "rocm_version": 502, "cpp": 503, "l21": 504, "librocm_core_file": 505, "is_file": 506, "librocm_core": 507, "ctypes": 508, "cdll": 509, "vererrors": 510, "c_uint32": 511, "get_rocm_core_version": 512, "getrocmversion": 513, "restype": 514, "argtypes": 515, "pointer": 516, "major": 517, "minor": 518, "byref": 519, "ver": 520, "uint32": 521, "ro": 522, "cm": 523, "get_neuronxcc_version": 524, "sysconfig": 525, "site_dir": 526, "get_paths": 527, "purelib": 528, "version_file": 529, "neuronxcc": 530, "executed": 531, "successfully": 532, "fp": 533, "read": 534, "regular": 535, "expression": 536, "search": 537, "__version__": 538, "group": 539, "could": 540, "site": 541, "paths": 542, "adapted": 543, "nvidia": 544, "apex": 545, "8b7a1ff183741dd8f9b87e7bafd04cfde99cea28": 546, "nvcc_output": 547, "universal_newlines": 548, "release_idx": 549, "index": 550, "release": 551, "nvcc_cuda_version": 552, "parse": 553, "universal": 554, "newlines": 555, "idx": 556, "get_gaudi_sw_version": 557, "returns": 558, "driver": 559, "enable": 560, "console": 561, "printing": 562, "hl": 563, "smi": 564, "shell": 565, "text": 566, "capture_output": 567, "env": 568, "enable_console": 569, "returncode": 570, "stdout": 571, "gaudi": 572, "sw": 573, "capture": 574, "get_vllm_version": 575, "get_version": 576, "write_to": 577, "_version": 578, "sep": 579, "versions": 580, "might": 581, "contain": 582, "cuda_version": 583, "main_cuda_version": 584, "cuda_version_str": 585, "source": 586, "tarball": 587, "required": 588, "pypi": 589, "sdist": 590, "argv": 591, "cu": 592, "neuron_version": 593, "neuron_version_str": 594, "unknown": 595, "write": 596, "get_requirements": 597, "requirements": 598, "requirements_dir": 599, "_read_requirements": 600, "resolved_requirements": 601, "line": 602, "startswith": 603, "common": 604, "cuda_major": 605, "cuda_minor": 606, "modified_requirements": 607, "req": 608, "12": 609, "built": 610, "unsupported": 611, "platform": 612, "please": 613, "resolved": 614, "modified": 615, "requestfuncinput": 616, "prompt": 617, "api_url": 618, "prompt_len": 619, "output_len": 620, "model": 621, "model_name": 622, "optional": 623, "logprobs": 624, "extra_body": 625, "multi_modal_content": 626, "ignore_eos": 627, "language": 628, "func": 629, "input": 630, "extra": 631, "body": 632, "multi": 633, "modal": 634, "ignore": 635, "eos": 636, "requestfuncoutput": 637, "generated_text": 638, "success": 639, "latency": 640, "float": 641, "output_tokens": 642, "ttft": 643, "time": 644, "token": 645, "itl": 646, "field": 647, "default_factory": 648, "inter": 649, "latencies": 650, "tpot": 651, "avg": 652, "next": 653, "generated": 654, "tokens": 655, "factory": 656, "get_model": 657, "pretrained_model_name_or_path": 658, "vllm_use_modelscope": 659, "lower": 660, "modelscope": 661, "snapshot_download": 662, "model_executor": 663, "model_loader": 664, "weight_utils": 665, "get_lock": 666, "lock": 667, "prevent": 668, "multiple": 669, "processes": 670, "weights": 671, "model_path": 672, "model_id": 673, "local_files_only": 674, "huggingface_hub": 675, "constants": 676, "hf_hub_offline": 677, "ignore_file_pattern": 678, "pt": 679, "safetensors": 680, "pretrained": 681, "snapshot": 682, "download": 683, "executor": 684, "weight": 685, "id": 686, "huggingface": 687, "hub": 688, "hf": 689, "offline": 690, "pattern": 691, "get_tokenizer": 692, "tokenizer_mode": 693, "auto": 694, "trust_remote_code": 695, "kwargs": 696, "union": 697, "pretrainedtokenizer": 698, "pretrainedtokenizerfast": 699, "slow": 700, "use_fast": 701, "fast": 702, "tokenizer": 703, "mode": 704, "mistral": 705, "transformers_utils": 706, "mistraltokenizer": 707, "importerror": 708, "requires": 709, "pip": 710, "from_pretrained": 711, "autotokenizer": 712, "trust": 713, "code": 714, "pre": 715, "trained": 716, "transformers": 717, "to_bytes": 718, "sr": 719, "buffer": 720, "io": 721, "bytesio": 722, "soundfile": 723, "wav": 724, "seek": 725, "bytes": 726, "rows": 727, "allocate_block": 728, "allocate_blocks": 729, "enforce": 730, "gc": 731, "collect": 732, "ahead": 733, "minimize": 734, "impact": 735, "among": 736, "runs": 737, "block_pool": 738, "blockpool": 739, "num_gpu_blocks": 740, "enable_caching": 741, "get_blocks_times": 742, "timecollector": 743, "us": 744, "free_blocks_times": 745, "num_iteration": 746, "blocks": 747, "get_new_blocks": 748, "free_blocks": 749, "cnt": 750, "dump_avg_max": 751, "tabulate": 752, "headers": 753, "iterations": 754, "total": 755, "nblocks": 756, "allocated": 757, "navg": 758, "nmax": 759, "free": 760, "tablefmt": 761, "grid": 762, "floatfmt": 763, "3f": 764, "allocate": 765, "block": 766, "gpu": 767, "caching": 768, "times": 769, "collector": 770, "iteration": 771, "new": 772, "dump": 773, "invoke_main": 774, "parser": 775, "flexibleargumentparser": 776, "description": 777, "benchmark": 778, "performance": 779, "kv": 780, "cache": 781, "add_argument": 782, "100000": 783, "1000": 784, "help": 785, "stablize": 786, "final": 787, "readings": 788, "nargs": 789, "10": 790, "50": 791, "100": 792, "500": 793, "parse_args": 794, "invoke": 795, "flexible": 796, "argument": 797, "add": 798, "samplerequest": 799, "represents": 800, "inference": 801, "benchmarking": 802, "expected_output_len": 803, "multi_modal_data": 804, "multimodaldatadict": 805, "lora_request": 806, "lorarequest": 807, "sample": 808, "expected": 809, "lora": 810, "lo": 811, "ra": 812, "benchmarkdataset": 813, "abc": 814, "default_seed": 815, "is_multimodal": 816, "dataset_path": 817, "random_seed": 818, "initialize": 819, "dataset": 820, "random": 821, "seed": 822, "indicates": 823, "reproducible": 824, "shuffling": 825, "sampling": 826, "defaults": 827, "ensuring": 828, "replaced": 829, "apply_multimodal_chat_transformation": 830, "mm_content": 831, "transform": 832, "multimodal": 833, "chat": 834, "method": 835, "models": 836, "expect": 837, "specific": 838, "conversation": 839, "role": 840, "user": 841, "load_data": 842, "must": 843, "overridden": 844, "subclasses": 845, "since": 846, "vary": 847, "depending": 848, "raises": 849, "notimplementederror": 850, "subclass": 851, "implement": 852, "todo": 853, "jenniferzhao": 854, "support": 855, "implemented": 856, "get_random_lora_request": 857, "pretrainedtokenizerbase": 858, "apply": 859, "transformation": 860, "mm": 861, "max_loras": 862, "lora_path": 863, "tuple": 864, "anytokenizer": 865, "associated": 866, "parameters": 867, "provided": 868, "randomly": 869, "selects": 870, "based": 871, "retrieves": 872, "cached": 873, "otherwise": 874, "selected": 875, "maximum": 876, "loras": 877, "disk": 878, "where": 879, "element": 880, "applicable": 881, "second": 882, "generate": 883, "lora_id": 884, "randint": 885, "lora_name": 886, "lora_int_id": 887, "lora_path_on_disk": 888, "lora_tokenizer_cache": 889, "get_lora_tokenizer": 890, "abstractmethod": 891, "num_requests": 892, "requests": 893, "abstract": 894, "logic": 895, "generating": 896, "objects": 897, "processing": 898, "maybe_oversample_requests": 899, "oversamples": 900, "size": 901, "less": 902, "than": 903, "desired": 904, "sampled": 905, "additional": 906, "choices": 907, "extend": 908, "oversampled": 909, "reach": 910, "samples": 911, "maybe": 912, "oversample": 913, "is_valid_sequence": 914, "min_len": 915, "max_prompt_len": 916, "1024": 917, "max_total_len": 918, "2048": 919, "skip_min_output_len_check": 920, "validate": 921, "sequence": 922, "lengths": 923, "pruning": 924, "criteria": 925, "copied": 926, "original": 927, "sample_hf_requests": 928, "sample_sharegpt_requests": 929, "functions": 930, "benchmark_serving": 931, "well": 932, "sample_requests": 933, "benchmark_throughput": 934, "invalid": 935, "conditions": 936, "prompt_too_short": 937, "output_too_short": 938, "prompt_too_long": 939, "combined_too_long": 940, "met": 941, "valid": 942, "min": 943, "sharegpt": 944, "serving": 945, "throughput": 946, "too": 947, "short": 948, "long": 949, "combined": 950, "get_adapter_absolute_path": 951, "adapter": 952, "process_image": 953, "image": 954, "mapping": 955, "multimedia": 956, "dictionary": 957, "supports": 958, "three": 959, "types": 960, "raw": 961, "expects": 962, "key": 963, "containing": 964, "pil": 965, "converts": 966, "rgb": 967, "saves": 968, "jpeg": 969, "memory": 970, "encodes": 971, "base64": 972, "treats": 973, "prepends": 974, "doesn": 975, "start": 976, "http": 977, "isinstance": 978, "convert_image_mode": 979, "image_data": 980, "save": 981, "image_base64": 982, "b64encode": 983, "getvalue": 984, "image_url": 985, "convert": 986, "randomdataset": 987, "values": 988, "default_prefix_len": 989, "default_range_ratio": 990, "default_input_len": 991, "default_output_len": 992, "128": 993, "prefix_len": 994, "range_ratio": 995, "input_len": 996, "random_range_ratio": 997, "vocab_size": 998, "num_special_tokens": 999, "num_special_tokens_to_add": 1000, "real_input_len": 1001, "prefix_token_ids": 1002, "np": 1003, "tolist": 1004, "input_low": 1005, "input_high": 1006, "output_low": 1007, "bound": 1008, "length": 1009, "least": 1010, "cause": 1011, "failures": 1012, "output_high": 1013, "logging": 1014, "debugging": 1015, "ratio": 1016, "vocab": 1017, "special": 1018, "real": 1019, "ids": 1020, "low": 1021, "high": 1022, "input_lens": 1023, "output_lens": 1024, "offsets": 1025, "inner_seq": 1026, "arange": 1027, "token_sequence": 1028, "after": 1029, "decoding": 1030, "encode": 1031, "again": 1032, "done": 1033, "because": 1034, "some": 1035, "cases": 1036, "consecutive": 1037, "give": 1038, "tokenized": 1039, "example": 1040, "gpt2tokenizer": 1041, "6880": 1042, "6881": 1043, "ġcalls": 1044, "1650": 1045, "939": 1046, "486": 1047, "ġcall": 1048, "sh": 1049, "ere": 1050, "uncontrolled": 1051, "change": 1052, "encoded": 1053, "truncated": 1054, "before": 1055, "being": 1056, "total_input_len": 1057, "re_encoded_sequence": 1058, "add_special_tokens": 1059, "lens": 1060, "inner": 1061, "seq": 1062, "sharegptdataset": 1063, "implements": 1064, "generates": 1065, "turns": 1066, "loading": 1067, "encoding": 1068, "entries": 1069, "two": 1070, "entry": 1071, "conversations": 1072, "shuffle": 1073, "enable_multimodal_chat": 1074, "break": 1075, "completion": 1076, "prompt_ids": 1077, "input_ids": 1078, "completion_ids": 1079, "new_output_len": 1080, "share": 1081, "gpt": 1082, "also": 1083, "sharegpt4video": 1084, "image_path": 1085, "gpt4": 1086, "video": 1087, "customdataset": 1088, "jsonl": 1089, "what": 1090, "capital": 1091, "india": 1092, "iran": 1093, "china": 1094, "dictionaries": 1095, "standardized": 1096, "filetype": 1097, "assume": 1098, "endswith": 1099, "jsonl_data": 1100, "pd": 1101, "read_json": 1102, "path_or_buf": 1103, "lines": 1104, "column": 1105, "columns": 1106, "each": 1107, "row": 1108, "dataframe": 1109, "corresponds": 1110, "want": 1111, "iterrows": 1112, "to_dict": 1113, "buf": 1114, "frame": 1115, "skip_chat_template": 1116, "sampled_requests": 1117, "item": 1118, "template": 1119, "apply_chat_template": 1120, "add_generation_prompt": 1121, "tokenize": 1122, "generation": 1123, "sonnetdataset": 1124, "simplified": 1125, "implementation": 1126, "sonnet": 1127, "poem": 1128, "550": 1129, "150": 1130, "readlines": 1131, "return_prompt_formatted": 1132, "calculate": 1133, "average": 1134, "tokenized_lines": 1135, "avg_len": 1136, "sum": 1137, "base_prompt": 1138, "pick": 1139, "many": 1140, "you": 1141, "base_msg": 1142, "base_fmt": 1143, "base_offset": 1144, "higher": 1145, "num_input_lines": 1146, "round": 1147, "num_prefix_lines": 1148, "formatted": 1149, "msg": 1150, "fmt": 1151, "offset": 1152, "prefix_lines": 1153, "while": 1154, "extra_lines": 1155, "prompt_formatted": 1156, "burstgptdataset": 1157, "burstgpt": 1158, "csv": 1159, "synthetic": 1160, "positive": 1161, "response": 1162, "df": 1163, "read_csv": 1164, "keep": 1165, "gpt4_df": 1166, "_sample_loaded_data": 1167, "random_state": 1168, "lora_req": 1169, "burst": 1170, "loaded": 1171, "state": 1172, "computed": 1173, "modulo": 1174, "token_ids": 1175, "huggingfacedataset": 1176, "datasets": 1177, "hosted": 1178, "supported_dataset_paths": 1179, "dataset_split": 1180, "no_stream": 1181, "dataset_subset": 1182, "load_stream": 1183, "load_dataset": 1184, "streaming": 1185, "hugging": 1186, "face": 1187, "stream": 1188, "subset": 1189, "conversationdataset": 1190, "lmms": 1191, "lab": 1192, "llava": 1193, "onevision": 1194, "aeala": 1195, "sharegpt_vicuna_unfiltered": 1196, "examples": 1197, "filtered_data": 1198, "dynamic_output": 1199, "conv": 1200, "completion_len": 1201, "enabled": 1202, "longer": 1203, "accurate": 1204, "actual": 1205, "la": 1206, "va": 1207, "one": 1208, "vision": 1209, "vicuna": 1210, "unfiltered": 1211, "filtered": 1212, "dynamic": 1213, "visionarenadataset": 1214, "arena": 1215, "lmarena": 1216, "ai": 1217, "visionarena": 1218, "bench": 1219, "v0": 1220, "parser_fn": 1221, "images": 1222, "instructcoderdataset": 1223, "instructcoder": 1224, "co": 1225, "likaixin": 1226, "designed": 1227, "general": 1228, "editing": 1229, "consists": 1230, "114": 1231, "239": 1232, "instruction": 1233, "triplets": 1234, "covers": 1235, "distinct": 1236, "scenario": 1237, "just": 1238, "do": 1239, "include": 1240, "explanation": 1241, "instruct": 1242, "coder": 1243, "mtbenchdataset": 1244, "mt": 1245, "philschmid": 1246, "turn": 1247, "similar": 1248, "9d98ab5ec": 1249, "offline_inference": 1250, "eagle": 1251, "l14": 1252, "l18": 1253, "noqa": 1254, "e501": 1255, "256": 1256, "sd": 1257, "llm": 1258, "aimodataset": 1259, "aimo": 1260, "reasoning": 1261, "questions": 1262, "mo": 1263, "validation": 1264, "aime": 1265, "numinamath": 1266, "cot": 1267, "problem": 1268, "solution": 1269, "32000": 1270, "numina": 1271, "math": 1272, "_format_zeta_prompt": 1273, "original_start_marker": 1274, "editable_region_start": 1275, "zeta": 1276, "edit": 1277, "prediction": 1278, "nep": 1279, "formats": 1280, "prompts": 1281, "outputs": 1282, "further": 1283, "extended": 1284, "events": 1285, "inputs": 1286, "marker": 1287, "indicating": 1288, "region": 1289, "zeta_prompt": 1290, "following": 1291, "focused": 1292, "output_start_index": 1293, "output_focused_region": 1294, "expected_output": 1295, "nexteditpredictiondataset": 1296, "zed": 1297, "industries": 1298, "mapping_prompt_funcs": 1299, "formatting_prompt_func": 1300, "funcs": 1301, "formatting": 1302, "asrdataset": 1303, "asr": 1304, "transcription": 1305, "tested": 1306, "domain": 1307, "speaking": 1308, "style": 1309, "ted": 1310, "lium": 1311, "talks": 1312, "oratory": 1313, "release1": 1314, "release2": 1315, "release3": 1316, "speaker": 1317, "adaptation": 1318, "voxpopuli": 1319, "european": 1320, "parliament": 1321, "en": 1322, "de": 1323, "fr": 1324, "librispeech": 1325, "audiobook": 1326, "narrated": 1327, "tedlium": 1328, "gigaspeech": 1329, "podcast": 1330, "youtube": 1331, "spontaneous": 1332, "xs": 1333, "xl": 1334, "spgispeech": 1335, "financial": 1336, "meetings": 1337, "ami": 1338, "ihm": 1339, "sdm": 1340, "openslr": 1341, "librispeech_asr": 1342, "facebook": 1343, "edinburghcstr": 1344, "speechcolab": 1345, "kensho": 1346, "whisper": 1347, "interface": 1348, "transcription_preamble": 1349, "startoftranscript": 1350, "transcribe": 1351, "notimestamps": 1352, "vox": 1353, "populi": 1354, "libri": 1355, "speech": 1356, "giga": 1357, "tube": 1358, "preamble": 1359, "skip_long_audios": 1360, "librosa": 1361, "skipped": 1362, "audio": 1363, "array": 1364, "sampling_rate": 1365, "duration_s": 1366, "get_duration": 1367, "duration": 1368, "30": 1369, "discarded": 1370, "due": 1371, "greater": 1372, "audios": 1373, "rate": 1374, "save_to_pytorch_benchmark_format": 1375, "argparse": 1376, "namespace": 1377, "results": 1378, "pt_records": 1379, "convert_to_pytorch_benchmark_format": 1380, "metrics": 1381, "extra_info": 1382, "avg_latency": 1383, "percentiles": 1384, "pt_file": 1385, "splitext": 1386, "output_json": 1387, "pytorch": 1388, "write_to_json": 1389, "records": 1390, "engine_args": 1391, "engineargs": 1392, "from_cli_args": 1393, "woosuk": 1394, "processed": 1395, "batch": 1396, "engine": 1397, "automatically": 1398, "batches": 1399, "dataclasses": 1400, "asdict": 1401, "llm_engine": 1402, "model_config": 1403, "max_model_len": 1404, "sampling_params": 1405, "samplingparams": 1406, "temperature": 1407, "top_p": 1408, "max_tokens": 1409, "detokenize": 1410, "disable_detokenize": 1411, "dummy_prompt_token_ids": 1412, "10000": 1413, "batch_size": 1414, "dummy_prompts": 1415, "prompttype": 1416, "prompt_token_ids": 1417, "llm_generate": 1418, "use_beam_search": 1419, "use_tqdm": 1420, "beam_search": 1421, "beamsearchparams": 1422, "beam_width": 1423, "run_to_completion": 1424, "profile_dir": 1425, "start_profile": 1426, "stop_profile": 1427, "start_time": 1428, "perf_counter": 1429, "end_time": 1430, "warming": 1431, "up": 1432, "tqdm": 1433, "num_iters_warmup": 1434, "desc": 1435, "warmup": 1436, "profile": 1437, "cli": 1438, "params": 1439, "top": 1440, "dummy": 1441, "beam": 1442, "width": 1443, "stop": 1444, "perf": 1445, "counter": 1446, "end": 1447, "iters": 1448, "vllm_torch_profiler_dir": 1449, "profiling": 1450, "saved": 1451, "num_iters": 1452, "percentages": 1453, "25": 1454, "75": 1455, "90": 1456, "99": 1457, "percentile": 1458, "mean": 1459, "seconds": 1460, "percentage": 1461, "specified": 1462, "indent": 1463, "profiler": 1464, "create_argument_parser": 1465, "till": 1466, "32": 1467, "sequences": 1468, "per": 1469, "action": 1470, "store_true": 1471, "responses": 1472, "detokenization": 1473, "measurement": 1474, "add_cli_args": 1475, "v1": 1476, "enables": 1477, "skews": 1478, "numbers": 1479, "set_defaults": 1480, "enable_prefix_caching": 1481, "store": 1482, "test_long_document_qa": 1483, "document": 1484, "qa": 1485, "given": 1486, "spent": 1487, "parameter": 1488, "strings": 1489, "execute": 1490, "4f": 1491, "secs": 1492, "repeat_prompts": 1493, "repeat_count": 1494, "repeat": 1495, "order": 1496, "depends": 1497, "repeated": 1498, "repetition": 1499, "modes": 1500, "tile": 1501, "entire": 1502, "interleave": 1503, "consecutively": 1504, "moving": 1505, "repeated_prompts": 1506, "shuffle_seed": 1507, "prepare": 1508, "beginning": 1509, "documents": 1510, "hi": 1511, "document_length": 1512, "num_documents": 1513, "repeat_mode": 1514, "warmup_prompts": 1515, "warm": 1516, "without": 1517, "automatic": 1518, "roughly": 1519, "paper": 1520, "excluding": 1521, "20000": 1522, "details": 1523, "max_ngram": 1524, "modelconfig": 1525, "opt": 1526, "125m": 1527, "task": 1528, "num_token": 1529, "num_spec_token": 1530, "dtype": 1531, "proposer": 1532, "ngramproposer": 1533, "vllm_config": 1534, "vllmconfig": 1535, "speculative_config": 1536, "speculativeconfig": 1537, "prompt_lookup_min": 1538, "min_ngram": 1539, "prompt_lookup_max": 1540, "num_speculative_tokens": 1541, "ngram": 1542, "propose": 1543, "20": 1544, "num_req": 1545, "speculative": 1546, "lookup": 1547, "gram": 1548, "drafting": 1549, "1500": 1550, "minimum": 1551, "15": 1552, "test_prefix": 1553, "cost": 1554, "sample_tokens": 1555, "get_vocab": 1556, "all_special_ids": 1557, "items": 1558, "sample_requests_from_dataset": 1559, "input_length_range": 1560, "fixed_output_len": 1561, "small": 1562, "out": 1563, "max_len": 1564, "filtered_requests": 1565, "completions": 1566, "completion_token_ids": 1567, "fixed": 1568, "sample_requests_from_random": 1569, "unique_part_token_ids": 1570, "unique": 1571, "part": 1572, "repeat_and_sort_requests": 1573, "sort": 1574, "repeated_requests": 1575, "map": 1576, "num_prompts": 1577, "helpful": 1578, "stats": 1579, "prompt_lens": 1580, "p50": 1581, "sorted": 1582, "specifies": 1583, "added": 1584, "subtract": 1585, "filtering": 1586, "get_random_flag": 1587, "flag": 1588, "filtered_dataset": 1589, "prune": 1590, "priority": 1591, "run_vllm": 1592, "_priority": 1593, "synthesize": 1594, "backend": 1595, "elapsed_time": 1596, "total_num_tokens": 1597, "2f": 1598, "requests_per_second": 1599, "tokens_per_second": 1600, "elapsed": 1601, "mii": 1602, "overrides": 1603, "benchmarkmetrics": 1604, "completed": 1605, "total_input": 1606, "total_output": 1607, "request_throughput": 1608, "request_goodput": 1609, "output_throughput": 1610, "total_token_throughput": 1611, "mean_ttft_ms": 1612, "median_ttft_ms": 1613, "std_ttft_ms": 1614, "percentiles_ttft_ms": 1615, "mean_tpot_ms": 1616, "median_tpot_ms": 1617, "std_tpot_ms": 1618, "percentiles_tpot_ms": 1619, "mean_itl_ms": 1620, "median_itl_ms": 1621, "std_itl_ms": 1622, "percentiles_itl_ms": 1623, "e2el": 1624, "stands": 1625, "taken": 1626, "client": 1627, "side": 1628, "sending": 1629, "receiving": 1630, "complete": 1631, "mean_e2el_ms": 1632, "median_e2el_ms": 1633, "std_e2el_ms": 1634, "percentiles_e2el_ms": 1635, "goodput": 1636, "ms": 1637, "median": 1638, "std": 1639, "calculate_metrics": 1640, "input_requests": 1641, "dur_s": 1642, "selected_percentile_metrics": 1643, "selected_percentiles": 1644, "goodput_config_dict": 1645, "actual_output_lens": 1646, "good_completed": 1647, "itls": 1648, "tpots": 1649, "all_tpots": 1650, "ttfts": 1651, "e2els": 1652, "backends": 1653, "instead": 1654, "looking": 1655, "bundled": 1656, "together": 1657, "inflate": 1658, "slightly": 1659, "latency_minus_ttft": 1660, "regard": 1661, "valid_metrics": 1662, "slo_values": 1663, "dur": 1664, "good": 1665, "minus": 1666, "slo": 1667, "milliseconds_to_seconds_conversion": 1668, "req_metric": 1669, "is_good_req": 1670, "warnings": 1671, "warn": 1672, "likely": 1673, "misconfiguration": 1674, "arguments": 1675, "stacklevel": 1676, "milliseconds": 1677, "conversion": 1678, "metric": 1679, "check_goodput_args": 1680, "valid_names": 1681, "parse_goodput": 1682, "slo_name": 1683, "slo_val": 1684, "found": 1685, "service": 1686, "objective": 1687, "non": 1688, "negative": 1689, "names": 1690, "val": 1691, "slo_pairs": 1692, "slo_pair": 1693, "argumenttypeerror": 1694, "objectives": 1695, "specify": 1696, "pairs": 1697, "pair": 1698, "file_name": 1699, "p99_ttft_ms": 1700, "p99_tpot_ms": 1701, "p99_itl_ms": 1702, "useful": 1703, "rather": 1704, "big": 1705, "later": 1706, "needed": 1707, "ignored_metrics": 1708, "generated_texts": 1709, "don": 1710, "suffix": 1711, "p99": 1712, "ignored": 1713, "texts": 1714, "served_model_name": 1715, "tokenizer_id": 1716, "ramp": 1717, "ramp_up_strategy": 1718, "request_rate": 1719, "inf": 1720, "controlled": 1721, "ramp_up_start_rps": 1722, "ramp_up_end_rps": 1723, "strategy": 1724, "both": 1725, "rps": 1726, "exponential": 1727, "base_url": 1728, "endpoint": 1729, "host": 1730, "port": 1731, "dataset_name": 1732, "corresponding": 1733, "served": 1734, "custom_output_len": 1735, "custom_skip_chat_template": 1736, "openai": 1737, "sonnet_input_len": 1738, "sonnet_output_len": 1739, "sonnet_prefix_len": 1740, "chat_template": 1741, "default_chat_template": 1742, "dataset_class": 1743, "hf_split": 1744, "train": 1745, "hf_subset": 1746, "supported_datasets": 1747, "cls": 1748, "__subclasses__": 1749, "consider": 1750, "contributing": 1751, "would": 1752, "like": 1753, "hf_output_len": 1754, "follow": 1755, "structure": 1756, "dataset_mapping": 1757, "sharegpt_output_len": 1758, "random_prefix_len": 1759, "random_input_len": 1760, "random_output_len": 1761, "keyerror": 1762, "top_k": 1763, "min_p": 1764, "openai_compatible_backends": 1765, "greedy": 1766, "llama": 1767, "cache_prompt": 1768, "static": 1769, "pause": 1770, "freeze": 1771, "benchmark_result": 1772, "asyncio": 1773, "burstiness": 1774, "disable_tqdm": 1775, "percentile_metrics": 1776, "metric_percentiles": 1777, "max_concurrency": 1778, "lora_modules": 1779, "save_result": 1780, "append_result": 1781, "result_json": 1782, "current_dt": 1783, "datetime": 1784, "now": 1785, "strftime": 1786, "date": 1787, "metadata": 1788, "result": 1789, "concurrency": 1790, "dt": 1791, "kvstring": 1792, "traffic": 1793, "save_detailed": 1794, "fields": 1795, "points": 1796, "del": 1797, "base_model_id": 1798, "max_concurrency_str": 1799, "qps": 1800, "detailed": 1801, "result_filename": 1802, "result_dir": 1803, "outfile": 1804, "newline": 1805, "tell": 1806, "online": 1807, "async_request_funcs": 1808, "keys": 1809, "server": 1810, "127": 1811, "localhost": 1812, "ipv4": 1813, "8000": 1814, "concurrent": 1815, "simulate": 1816, "enforcing": 1817, "controls": 1818, "initiated": 1819, "control": 1820, "allowed": 1821, "means": 1822, "combination": 1823, "async": 1824, "enough": 1825, "unspecified": 1826, "disabled": 1827, "logprob": 1828, "returned": 1829, "sent": 1830, "poisson": 1831, "gamma": 1832, "distribution": 1833, "arrival": 1834, "factor": 1835, "take": 1836, "effect": 1837, "follows": 1838, "intervals": 1839, "bursty": 1840, "uniform": 1841, "progress": 1842, "bar": 1843, "launched": 1844, "saving": 1845, "whether": 1846, "information": 1847, "ttfs": 1848, "etc": 1849, "metavar": 1850, "tp": 1851, "record": 1852, "keeping": 1853, "purposes": 1854, "deepspeed_mii": 1855, "tgi": 1856, "comma": 1857, "separated": 1858, "report": 1859, "percentils": 1860, "th": 1861, "spaces": 1862, "definition": 1863, "refer": 1864, "distserve": 1865, "arxiv": 1866, "org": 1867, "pdf": 1868, "2401": 1869, "09670": 1870, "blog": 1871, "hao": 1872, "blogs": 1873, "custom_group": 1874, "add_argument_group": 1875, "options": 1876, "deepspeed": 1877, "dist": 1878, "serve": 1879, "applying": 1880, "sonnet_group": 1881, "sharegpt_group": 1882, "random_group": 1883, "define": 1884, "symmetric": 1885, "hf_group": 1886, "sampling_group": 1887, "always": 1888, "mistral_common": 1889, "preregistered": 1890, "passed": 1891, "launching": 1892, "script": 1893, "chooses": 1894, "linear": 1895, "initial": 1896, "over": 1897, "starting": 1898, "needs": 1899, "ending": 1900, "process_one_metric": 1901, "metric_attribute_name": 1902, "metric_name": 1903, "metric_header": 1904, "adds": 1905, "statistics": 1906, "40": 1907, "getattr": 1908, "mean_": 1909, "_ms": 1910, "median_": 1911, "std_": 1912, "percentiles_": 1913, "p_word": 1914, "header": 1915, "word": 1916, "representing": 1917, "attributes": 1918, "schema": 1919, "structure_type": 1920, "json_schema_path": 1921, "dir_path": 1922, "realpath": 1923, "__file__": 1924, "structured_schemas": 1925, "structured_schema_1": 1926, "json_schemas": 1927, "deepcopy": 1928, "properties": 1929, "__optional_field_": 1930, "uuid": 1931, "uuid4": 1932, "schemas": 1933, "gen_prompt": 1934, "brief": 1935, "dumps": 1936, "get_schema": 1937, "grammar": 1938, "select_statement": 1939, "table": 1940, "condition": 1941, "col_1": 1942, "col_2": 1943, "structured": 1944, "gen": 1945, "statement": 1946, "col": 1947, "table_1": 1948, "table_2": 1949, "sql": 1950, "query": 1951, "username": 1952, "email": 1953, "users": 1954, "address": 1955, "alan": 1956, "turing": 1957, "who": 1958, "works": 1959, "enigma": 1960, "choice": 1961, "classify": 1962, "sentiment": 1963, "wonderful": 1964, "xgrammar_bench": 1965, "nousresearch": 1966, "eval": 1967, "full_dataset_len": 1968, "_filter_func": 1969, "has_xgrammar_unsupported_json_features": 1970, "num_filtered_out": 1971, "features": 1972, "len_dataset": 1973, "data_point_idx": 1974, "xgrammar": 1975, "nous": 1976, "research": 1977, "full": 1978, "point": 1979, "evaluate": 1980, "ret": 1981, "_eval_correctness_json": 1982, "_eval_correctness_choice": 1983, "_eval_correctness_regex": 1984, "_eval_correctness": 1985, "guided_json": 1986, "guided_regex": 1987, "guided_choice": 1988, "scores": 1989, "res": 1990, "score": 1991, "correctness": 1992, "not_none_scores": 1993, "guided": 1994, "guided_grammar": 1995, "no_structured_output": 1996, "structured_output_ratio": 1997, "save_results": 1998, "result_file_name": 1999, "_out": 2000, "correct_rate": 2001, "correct": 2002, "prepare_extra_body": 2003, "requestoutput": 2004, "textprompt": 2005, "tokensprompt": 2006, "lora_requests": 2007, "enable_lora": 2008, "beamsearch": 2009, "run_vllm_chat": 2010, "recommended": 2011, "properly": 2012, "handles": 2013, "run_hf": 2014, "max_batch_size": 2015, "automodelforcausallm": 2016, "torch_dtype": 2017, "float16": 2018, "model_type": 2019, "padding": 2020, "pad_token": 2021, "eos_token": 2022, "pbar": 2023, "max_output_len": 2024, "next_prompt_len": 2025, "next_output_len": 2026, "return_tensors": 2027, "llm_outputs": 2028, "do_sample": 2029, "num_return_sequences": 2030, "use_cache": 2031, "max_new_tokens": 2032, "causal": 2033, "lm": 2034, "pad": 2035, "tensors": 2036, "batch_decode": 2037, "skip_special_tokens": 2038, "clear": 2039, "run_mii": 2040, "tensor_parallel_size": 2041, "tensor_parallel": 2042, "terminate_server": 2043, "tensor": 2044, "parallel": 2045, "terminate": 2046, "get_requests": 2047, "common_kwargs": 2048, "sample_kwargs": 2049, "dataset_cls": 2050, "is_multi_modal": 2051, "request_outputs": 2052, "async_engine": 2053, "uvloop": 2054, "run_vllm_async": 2055, "asyncengineargs": 2056, "disable_frontend_multiprocessing": 2057, "hf_max_batch_size": 2058, "frontend": 2059, "multiprocessing": 2060, "total_prompt_tokens": 2061, "total_output_tokens": 2062, "033": 2063, "91mwarning": 2064, "0m": 2065, "detected": 2066, "counted": 2067, "issues": 2068, "9778": 2069, "counts": 2070, "91m": 2071, "validate_args": 2072, "deprecation": 2073, "defaulting": 2074, "deprecated": 2075, "valid_backends": 2076, "checks": 2077, "settings": 2078, "validations": 2079, "quantization": 2080, "currently": 2081, "16222": 2082, "data_parallel_size": 2083, "form": 2084, "prompt_or_response": 2085, "decoupled": 2086, "adapters": 2087, "relative": 2088, "identifier": 2089, "much": 2090, "versus": 2091, "remains": 2092, "approximately": 2093, "dtaset": 2094, "oss": 2095, "wiki": 2096, "integrate": 2097, "database": 2098, "benchmark_values": 2099, "vars": 2100, "infencoder": 2101, "jsonencoder": 2102, "clear_inf": 2103, "isinf": 2104, "iterencode": 2105, "encoder": 2106, "__name__": 2107, "serializable": 2108, "ns": 2109, "scale": 2110, "_sum": 2111, "_max": 2112, "monotonic_ns": 2113, "__enter__": 2114, "__exit__": 2115, "exc_type": 2116, "baseexception": 2117, "exc_value": 2118, "exc_traceback": 2119, "tracebacktype": 2120, "monotonic": 2121, "enter": 2122, "exc": 2123, "bench_fn": 2124, "label": 2125, "sub_label": 2126, "tmeasurement": 2127, "min_run_time": 2128, "globals": 2129, "tbenchmark": 2130, "timer": 2131, "stmt": 2132, "blocked_autorange": 2133, "sub": 2134, "blocked": 2135, "autorange": 2136, "bench_int8": 2137, "iterable": 2138, "int8": 2139, "b_compressed": 2140, "make_rand_sparse_tensors": 2141, "scale_a": 2142, "float32": 2143, "scale_b": 2144, "bias": 2145, "zeros": 2146, "bfloat16": 2147, "cutlass_scaled_sparse_mm": 2148, "out_ref": 2149, "cutlass_scaled_mm": 2150, "allclose": 2151, "incorrect": 2152, "timers": 2153, "impl": 2154, "pytorch_bf16_bf16_bf16_matmul": 2155, "scales": 2156, "pytorch_fp16_fp16_fp16_matmul": 2157, "cutlass": 2158, "cutlass_i8_i8_bf16_scaled_mm": 2159, "cutlass_i8_i8_bf16_scaled_mm_bias": 2160, "sparse": 2161, "compressed": 2162, "rand": 2163, "scaled": 2164, "bf16": 2165, "matmul": 2166, "fp16": 2167, "i8": 2168, "cutlass_i8_i8_bf16_scaled_sparse_mm": 2169, "cutlass_i8_i8_bf16_scaled_sparse_mm_bias": 2170, "bench_fp8": 2171, "float8_e4m3fn": 2172, "fp8": 2173, "accum": 2174, "pytorch_fp8_fp8_bf16_scaled_mm": 2175, "_scaled_mm": 2176, "out_dtype": 2177, "pytorch_fp8_fp8_bf16_scaled_mm_fast_accum": 2178, "use_fast_accum": 2179, "float8": 2180, "e4m3fn": 2181, "pytorch_fp8_fp8_fp16_scaled_mm": 2182, "pytorch_fp8_fp8_fp16_scaled_mm_fast_accum": 2183, "cutlass_fp8_fp8_bf16_scaled_mm": 2184, "cutlass_fp8_fp8_bf16_scaled_sparse_mm": 2185, "cutlass_fp8_fp8_fp16_scaled_sparse_mm": 2186, "cutlass_fp8_fp8_bf16_scaled_sparse_mm_bias": 2187, "cutlass_fp8_fp8_fp16_scaled_sparse_mm_bias": 2188, "print_timers": 2189, "compare": 2190, "mkns": 2191, "gemm": 2192, "mkn": 2193, "make_output": 2194, "base_description": 2195, "timestamp": 2196, "pickle": 2197, "pkl": 2198, "run_square_bench": 2199, "dim_sizes": 2200, "dim_start": 2201, "dim_end": 2202, "dim_increment": 2203, "square_bench": 2204, "square": 2205, "dim": 2206, "sizes": 2207, "increment": 2208, "run_range_bench": 2209, "m_constant": 2210, "ks": 2211, "k_constant": 2212, "n_constant": 2213, "range_bench": 2214, "constant": 2215, "run_model_bench": 2216, "enumerate": 2217, "model_shapes": 2218, "tp_size": 2219, "kns": 2220, "kn": 2221, "tp_split_dim": 2222, "weight_shapes": 2223, "model_bench_data": 2224, "models_tps": 2225, "itertools": 2226, "product": 2227, "tp_sizes": 2228, "batch_sizes": 2229, "model_tp": 2230, "all_data": 2231, "model_bench": 2232, "shapes": 2233, "tps": 2234, "to_torch_dtype": 2235, "to_fp8": 2236, "finfo": 2237, "clamp": 2238, "to_int8": 2239, "to_bf16": 2240, "to_fp16": 2241, "make_rand_tensors": 2242, "randn": 2243, "prune_to_2_4": 2244, "reshape": 2245, "groups": 2246, "original_shape": 2247, "shape": 2248, "reshaped": 2249, "indices": 2250, "topk": 2251, "abs": 2252, "binary": 2253, "mask": 2254, "zeros_like": 2255, "scatter_": 2256, "ones_like": 2257, "pruned": 2258, "scatter": 2259, "ones": 2260, "cutlass_sparse_compress": 2261, "compress": 2262, "make_n_rand_sparse_tensors": 2263, "num_tensors": 2264, "b_comp": 2265, "bcomps": 2266, "es": 2267, "bs": 2268, "comp": 2269, "bench_kernels": 2270, "kernels": 2271, "azp": 2272, "int32": 2273, "azp_adj": 2274, "bench_fns": 2275, "cutlass_i8_i8_bf16_scaled_mm_azp": 2276, "cutlass_scaled_mm_azp": 2277, "cutlass_i8_i8_bf16_scaled_mm_azp_bias": 2278, "cutlass_i8_i8_bf16_scaled_mm_azp_pt": 2279, "cutlass_i8_i8_bf16_scaled_mm_azp_pt_bias": 2280, "adj": 2281, "fns": 2282, "matches": 2283, "running": 2284, "a_cont": 2285, "contiguous": 2286, "block_scale_a": 2287, "cdiv": 2288, "block_scale_b": 2289, "block_scale_a_m_major": 2290, "block_scale_b_k_major": 2291, "cont": 2292, "cutlass_fp8_fp8_fp16_scaled_mm": 2293, "cutlass_fp8_fp8_bf16_scaled_mm_bias": 2294, "cutlass_fp8_fp8_fp16_scaled_mm_bias": 2295, "triton_fp8_fp8_fp16_scaled_mm_blockwise": 2296, "w8a8_block_fp8_matmul": 2297, "cutlass_fp8_fp8_fp16_scaled_mm_blockwise": 2298, "triton": 2299, "blockwise": 2300, "w8a8": 2301, "argumentparser": 2302, "disaggregation": 2303, "proxy": 2304, "timeout": 2305, "300": 2306, "services": 2307, "queue": 2308, "limit": 2309, "prefill": 2310, "8100": 2311, "8200": 2312, "aiohttp_timeout": 2313, "aiohttp": 2314, "clienttimeout": 2315, "max_concurrent_requests": 2316, "max_concurrent": 2317, "request_queue_size": 2318, "queue_size": 2319, "rate_limit": 2320, "prefill_service_url": 2321, "prefill_url": 2322, "decode_service_url": 2323, "decode_url": 2324, "app": 2325, "quart": 2326, "limiter": 2327, "rate_limiter": 2328, "ratelimiter": 2329, "request_queue": 2330, "requestqueue": 2331, "attach": 2332, "application": 2333, "instance": 2334, "startup": 2335, "before_serving": 2336, "starts": 2337, "create_task": 2338, "forward_request": 2339, "forward": 2340, "limiting": 2341, "handling": 2342, "authorization": 2343, "bearer": 2344, "openai_api_key": 2345, "manager": 2346, "clientsession": 2347, "session": 2348, "post": 2349, "chunks": 2350, "chunk_bytes": 2351, "iter_chunked": 2352, "yield": 2353, "chunk": 2354, "iter": 2355, "chunked": 2356, "handle": 2357, "error_text": 2358, "await": 2359, "clienterror": 2360, "connection": 2361, "unavailable": 2362, "timeouterror": 2363, "connecting": 2364, "process_request": 2365, "through": 2366, "stages": 2367, "original_request_data": 2368, "get_json": 2369, "prefill_request": 2370, "stage": 2371, "generator": 2372, "make_response": 2373, "internal": 2374, "content_type": 2375, "route": 2376, "methods": 2377, "handle_request": 2378, "incoming": 2379, "enqueue": 2380, "reject": 2381, "busy": 2382, "503": 2383, "cancellederror": 2384, "cancellation": 2385, "cancelled": 2386, "bucket": 2387, "num_available_tokens": 2388, "last_refill": 2389, "last": 2390, "refill": 2391, "synchronization": 2392, "acquire": 2393, "current_time": 2394, "wait": 2395, "wait_time": 2396, "sleep": 2397, "__aenter__": 2398, "__aexit__": 2399, "cleanup": 2400, "aenter": 2401, "aexit": 2402, "max_queue_size": 2403, "semaphore": 2404, "deque": 2405, "sync": 2406, "queued": 2407, "popleft": 2408, "01": 2409, "event": 2410, "loop": 2411, "roundrobinproxy": 2412, "target_ports": 2413, "port_cycle": 2414, "cycle": 2415, "target_port": 2416, "target_url": 2417, "path_qs": 2418, "web": 2419, "streamresponse": 2420, "iter_any": 2421, "write_eof": 2422, "robin": 2423, "ports": 2424, "qs": 2425, "eof": 2426, "bench_params_t": 2427, "num_tokens": 2428, "hidden_size": 2429, "add_residual": 2430, "hidden": 2431, "residual": 2432, "get_bench_params": 2433, "fixtures": 2434, "hidden_sizes": 2435, "8129": 2436, "dtypes": 2437, "combinations": 2438, "bench_params": 2439, "unfused_int8_impl": 2440, "rms_norm_layer": 2441, "rmsnorm": 2442, "quant_dtype": 2443, "norm": 2444, "torch_out": 2445, "forward_cuda": 2446, "quant": 2447, "scaled_int8_quant": 2448, "unfused": 2449, "rms": 2450, "layer": 2451, "unfused_fp8_impl": 2452, "scaled_fp8_quant": 2453, "fused_impl": 2454, "stores": 2455, "rms_norm_dynamic_per_token_quant": 2456, "1e": 2457, "fused": 2458, "normal_": 2459, "randn_like": 2460, "fused_int8_impl": 2461, "fused_fp8_impl": 2462, "normal": 2463, "set_default_device": 2464, "bp": 2465, "rms_norm_dpt_quant": 2466, "dpt": 2467, "bench_run": 2468, "num_experts": 2469, "per_act_token": 2470, "per_out_ch": 2471, "nvfp4": 2472, "blockscaled": 2473, "vs": 2474, "half": 2475, "w1": 2476, "w2": 2477, "a_fp8_scale": 2478, "w1_fp8q": 2479, "w2_fp8q": 2480, "w1_fp8scale": 2481, "w2_fp8scale": 2482, "expert": 2483, "w1_fp8q_notransp": 2484, "clone": 2485, "w2_fp8q_notransp": 2486, "transpose": 2487, "topk_weights": 2488, "topk_ids": 2489, "fused_topk": 2490, "renormalize": 2491, "quant_blocksize": 2492, "16": 2493, "w1_blockscale": 2494, "w2_blockscale": 2495, "experts": 2496, "act": 2497, "ch": 2498, "fp8q": 2499, "fp8scale": 2500, "notransp": 2501, "blocksize": 2502, "blockscale": 2503, "n_b_scales": 2504, "k_b_scales": 2505, "w1_fp4": 2506, "uint8": 2507, "w2_fp4": 2508, "w1_gs": 2509, "w2_gs": 2510, "a1_gs": 2511, "a2_gs": 2512, "w1_e": 2513, "w2_e": 2514, "w1_amax": 2515, "w2_amax": 2516, "float8_e4m3_max": 2517, "float4_e2m1_max": 2518, "scaled_fp4_quant": 2519, "run_triton_moe": 2520, "w1_scale": 2521, "w2_scale": 2522, "num_repeats": 2523, "fused_experts": 2524, "use_fp8_w8a8": 2525, "a1_scale": 2526, "run_cutlass_moe_fp4": 2527, "fp4": 2528, "gs": 2529, "a1": 2530, "a2": 2531, "amax": 2532, "e4": 2533, "m3": 2534, "float4": 2535, "e2": 2536, "m1": 2537, "repeats": 2538, "nvtx": 2539, "annotate": 2540, "cutlass_moe_fp4": 2541, "color": 2542, "green": 2543, "a1_gscale": 2544, "a2_gscale": 2545, "w1_alphas": 2546, "w2_alphas": 2547, "run_cutlass_from_graph": 2548, "set_current_vllm_config": 2549, "parallel_config": 2550, "parallelconfig": 2551, "pipeline_parallel_size": 2552, "gscale": 2553, "alphas": 2554, "graph": 2555, "pipeline": 2556, "run_triton_from_graph": 2557, "replay_graph": 2558, "replay": 2559, "synchronize": 2560, "cutlass_stream": 2561, "cutlass_graph": 2562, "cudagraph": 2563, "triton_stream": 2564, "triton_graph": 2565, "num_warmup": 2566, "num_runs": 2567, "baseline": 2568, "triton_moe": 2569, "triton_moe_cuda_graphs": 2570, "cutlass_moe_fp4_cuda_graphs": 2571, "graphs": 2572, "weight_shapes_moe": 2573, "size_k": 2574, "size_n": 2575, "limit_k": 2576, "limit_n": 2577, "per_act_token_opts": 2578, "per_out_ch_opts": 2579, "size_m": 2580, "opts": 2581, "a_scale": 2582, "w1_q": 2583, "w2_q": 2584, "token_expert_indices": 2585, "run_cutlass_moe": 2586, "cutlass_moe_fp8": 2587, "grouped_gemm_moe": 2588, "grouped_gemm_moe_cuda_graphs": 2589, "grouped": 2590, "default_batch_sizes": 2591, "do_profile": 2592, "num_warmup_iters": 2593, "current_platform": 2594, "seed_everything": 2595, "run_cuda_benchmark": 2596, "cudart": 2597, "cudaprofilerstart": 2598, "cudaprofilerstop": 2599, "run_benchmark": 2600, "kernel": 2601, "1000000": 2602, "everything": 2603, "dtype_to_str": 2604, "f16": 2605, "f32": 2606, "make_rand_lora_weight_tensor": 2607, "num_loras": 2608, "a_shape": 2609, "b_shape": 2610, "c_shape": 2611, "a_dtype": 2612, "b_dtype": 2613, "c_dtype": 2614, "num_slices": 2615, "matrices": 2616, "slices": 2617, "make_prompt_lora_mapping": 2618, "num_active_loras": 2619, "sort_by_lora_id": 2620, "mapped": 2621, "refers": 2622, "divide": 2623, "equally": 2624, "part_size": 2625, "prompt_lora_mapping": 2626, "active": 2627, "make_token_lora_mapping": 2628, "seq_len_tensor": 2629, "token_lora_mapping": 2630, "seq_lens_tensor": 2631, "current_offset": 2632, "b_id": 2633, "lora_index": 2634, "ref_group_gemm": 2635, "ref_out": 2636, "lora_weights": 2637, "seq_lens_cpu": 2638, "prompt_lora_mapping_cpu": 2639, "scaling": 2640, "add_inputs": 2641, "reference": 2642, "operations": 2643, "out_list": 2644, "b_length": 2645, "nn": 2646, "functional": 2647, "cat_result": 2648, "copy_": 2649, "optype": 2650, "enum": 2651, "lora_shrink": 2652, "lora_expand": 2653, "from_str": 2654, "unrecognized": 2655, "is_shrink_fn": 2656, "is_expand_fn": 2657, "seq_length": 2658, "lora_rank": 2659, "matmul_dtypes": 2660, "op_dtype": 2661, "matmul_shapes": 2662, "op_type": 2663, "op": 2664, "shrink": 2665, "expand": 2666, "rank": 2667, "inherently": 2668, "run_ref_group_gemm": 2669, "operation": 2670, "different": 2671, "accounts": 2672, "those": 2673, "differences": 2674, "executing": 2675, "w_dtype": 2676, "slice_idx": 2677, "slice_offset": 2678, "slice": 2679, "benchmarkcontext": 2680, "with_seq_length": 2681, "ctx": 2682, "with_num_slices": 2683, "bench_label": 2684, "bench_sublabel": 2685, "sl": 2686, "sort_by_lora": 2687, "sublabel": 2688, "benchmarktensors": 