{"def": 0, "load_module_from_path": 1, "module_name": 2, "path": 3, "spec": 4, "importlib": 5, "util": 6, "spec_from_file_location": 7, "module": 8, "module_from_spec": 9, "sys": 10, "modules": 11, "loader": 12, "exec_module": 13, "return": 14, "is_sccache_available": 15, "bool": 16, "which": 17, "sccache": 18, "none": 19, "int": 20, "os": 21, "getenv": 22, "vllm_disable_sccache": 23, "is_ccache_available": 24, "ccache": 25, "is_ninja_available": 26, "ninja": 27, "is_url_available": 28, "url": 29, "str": 30, "from": 31, "urllib": 32, "request": 33, "import": 34, "urlopen": 35, "status": 36, "try": 37, "except": 38, "exception": 39, "false": 40, "200": 41, "class": 42, "cmakeextension": 43, "extension": 44, "__init__": 45, "self": 46, "name": 47, "cmake_lists_dir": 48, "kwa": 49, "super": 50, "sources": 51, "py_limited_api": 52, "true": 53, "abspath": 54, "cmake_build_ext": 55, "build_ext": 56, "dict": 57, "directories": 58, "have": 59, "been": 60, "configured": 61, "did_config": 62, "determine": 63, "number": 64, "compilation": 65, "jobs": 66, "optionally": 67, "nvcc": 68, "compile": 69, "threads": 70, "compute_num_jobs": 71, "num_jobs": 72, "either": 73, "value": 74, "max_jobs": 75, "environment": 76, "variable": 77, "defined": 78, "cpus": 79, "available": 80, "envs": 81, "logger": 82, "info": 83, "using": 84, "else": 85, "sched_getaffinity": 86, "isn": 87, "universally": 88, "so": 89, "fall": 90, "back": 91, "cpu_count": 92, "we": 93, "get": 94, "error": 95, "here": 96, "len": 97, "attributeerror": 98, "nvcc_threads": 99, "_is_cuda": 100, "get_nvcc_cuda_version": 101, "version": 102, "11": 103, "when": 104, "set": 105, "reduce": 106, "avoid": 107, "overloading": 108, "system": 109, "max": 110, "perform": 111, "cmake": 112, "configuration": 113, "single": 114, "configure": 115, "ext": 116, "ve": 117, "already": 118, "cmakelists": 119, "txt": 120, "exit": 121, "early": 122, "select": 123, "build": 124, "type": 125, "note": 126, "optimization": 127, "level": 128, "debug": 129, "default_cfg": 130, "relwithdebinfo": 131, "cfg": 132, "cmake_build_type": 133, "cmake_args": 134, "dcmake_build_type": 135, "format": 136, "dvllm_target_device": 137, "vllm_target_device": 138, "verbose": 139, "dcmake_verbose_makefile": 140, "dcmake_c_compiler_launcher": 141, "dcmake_cxx_compiler_launcher": 142, "dcmake_cuda_compiler_launcher": 143, "dcmake_hip_compiler_launcher": 144, "elif": 145, "pass": 146, "python": 147, "executable": 148, "can": 149, "find": 150, "exact": 151, "match": 152, "dvllm_python_executable": 153, "reuse": 154, "dependencies": 155, "subsequent": 156, "calls": 157, "dvllm_python_path": 158, "join": 159, "override": 160, "base": 161, "directory": 162, "fetchcontent": 163, "downloads": 164, "root": 165, "deps": 166, "allows": 167, "sharing": 168, "between": 169, "profiles": 170, "plays": 171, "more": 172, "nicely": 173, "fetchcontent_base_dir": 174, "fc_base_dir": 175, "root_dir": 176, "environ": 177, "dfetchcontent_base_dir": 178, "setup": 179, "parallelism": 180, "tool": 181, "dnvcc_threads": 182, "build_tool": 183, "dcmake_job_pool_compile": 184, "string": 185, "dcmake_job_pools": 186, "default": 187, "whatever": 188, "picks": 189, "make": 190, "sure": 191, "use": 192, "cuda_home": 193, "dcmake_cuda_compiler": 194, "bin": 195, "subprocess": 196, "check_call": 197, "cwd": 198, "build_temp": 199, "build_extensions": 200, "ensure": 201, "present": 202, "working": 203, "check_output": 204, "oserror": 205, "raise": 206, "runtimeerror": 207, "cannot": 208, "create": 209, "does": 210, "exist": 211, "exists": 212, "makedirs": 213, "targets": 214, "target_name": 215, "removeprefix": 216, "vllm": 217, "vllm_flash_attn": 218, "all": 219, "extensions": 220, "append": 221, "build_args": 222, "target": 223, "install": 224, "libraries": 225, "proper": 226, "location": 227, "outdir": 228, "get_ext_fullpath": 229, "parent": 230, "absolute": 231, "skip": 232, "same": 233, "continue": 234, "appends": 235, "prefix": 236, "contains": 237, "need": 238, "remove": 239, "range": 240, "count": 241, "should": 242, "actually": 243, "components": 244, "install_args": 245, "component": 246, "run": 247, "first": 248, "standard": 249, "command": 250, "copy": 251, "py": 252, "build_lib": 253, "current": 254, "included": 255, "editable": 256, "glob": 257, "files": 258, "recursive": 259, "file": 260, "dst_file": 261, "split": 262, "print": 263, "copying": 264, "dirname": 265, "exist_ok": 266, "copy_file": 267, "precompiled_build_ext": 268, "disables": 269, "building": 270, "precompiled": 271, "binaries": 272, "assert": 273, "vllm_use_precompiled": 274, "only": 275, "supported": 276, "cuda": 277, "builds": 278, "skipping": 279, "precompiled_wheel_utils": 280, "extracts": 281, "other": 282, "existing": 283, "wheel": 284, "staticmethod": 285, "extract_precompiled_and_patch_package": 286, "wheel_url_or_path": 287, "tempfile": 288, "zipfile": 289, "temp_dir": 290, "isfile": 291, "wheel_filename": 292, "mkdtemp": 293, "wheels": 294, "wheel_path": 295, "downloading": 296, "urlretrieve": 297, "filename": 298, "package_data_patch": 299, "files_to_copy": 300, "_c": 301, "abi3": 302, "_moe_c": 303, "_flashmla_c": 304, "_vllm_fa2_c": 305, "_vllm_fa3_c": 306, "cumem_allocator": 307, "compiled_regex": 308, "re": 309, "file_members": 310, "list": 311, "filter": 312, "lambda": 313, "filelist": 314, "extract": 315, "target_path": 316, "open": 317, "src": 318, "wb": 319, "dst": 320, "shutil": 321, "copyfileobj": 322, "pkg": 323, "replace": 324, "setdefault": 325, "basename": 326, "finally": 327, "removing": 328, "temporary": 329, "rmtree": 330, "get_base_commit_in_main_branch": 331, "force": 332, "nightly": 333, "mainly": 334, "used": 335, "ci": 336, "testing": 337, "vllm_test_use_precompiled_nightly_wheel": 338, "latest": 339, "commit": 340, "hash": 341, "upstream": 342, "main": 343, "branch": 344, "resp_json": 345, "curl": 346, "https": 347, "api": 348, "github": 349, "com": 350, "repos": 351, "project": 352, "commits": 353, "decode": 354, "utf": 355, "upstream_main_commit": 356, "json": 357, "loads": 358, "sha": 359, "docker": 360, "context": 361, "git": 362, "may": 363, "immutable": 364, "missing": 365, "vllm_docker_build_context": 366, "check": 367, "local": 368, "repo": 369, "cat": 370, "calledprocesserror": 371, "fetch": 372, "remote": 373, "repository": 374, "update": 375, "any": 376, "branches": 377, "ensures": 378, "ref": 379, "its": 380, "history": 381, "our": 382, "current_branch": 383, "show": 384, "strip": 385, "base_commit": 386, "merge": 387, "valueerror": 388, "err": 389, "warning": 390, "failed": 391, "compatible": 392, "your": 393, "dev": 394, "_no_device": 395, "empty": 396, "has_cuda": 397, "torch": 398, "_is_neuron": 399, "_is_tpu": 400, "_is_hip": 401, "rocm": 402, "hip": 403, "neuron": 404, "tpu": 405, "_is_cpu": 406, "cpu": 407, "_is_xpu": 408, "xpu": 409, "_build_custom_ops": 410, "get_rocm_version": 411, "rocm_home": 412, "librocm": 413, "core": 414, "see": 415, "blob": 416, "d11f5c20d500f729c393680a01fa902ebf92094b": 417, "rocm_version": 418, "cpp": 419, "l21": 420, "librocm_core_file": 421, "lib": 422, "is_file": 423, "librocm_core": 424, "ctypes": 425, "cdll": 426, "vererrors": 427, "c_uint32": 428, "get_rocm_core_version": 429, "getrocmversion": 430, "restype": 431, "argtypes": 432, "pointer": 433, "major": 434, "minor": 435, "patch": 436, "byref": 437, "get_neuronxcc_version": 438, "sysconfig": 439, "site_dir": 440, "get_paths": 441, "purelib": 442, "version_file": 443, "neuronxcc": 444, "executed": 445, "successfully": 446, "fp": 447, "content": 448, "read": 449, "regular": 450, "expression": 451, "search": 452, "__version__": 453, "group": 454, "could": 455, "output": 456, "adapted": 457, "nvidia": 458, "apex": 459, "8b7a1ff183741dd8f9b87e7bafd04cfde99cea28": 460, "nvcc_output": 461, "universal_newlines": 462, "release_idx": 463, "index": 464, "release": 465, "nvcc_cuda_version": 466, "parse": 467, "get_gaudi_sw_version": 468, "returns": 469, "driver": 470, "enable": 471, "console": 472, "printing": 473, "hl": 474, "smi": 475, "shell": 476, "text": 477, "capture_output": 478, "env": 479, "enable_console": 480, "returncode": 481, "stdout": 482, "get_vllm_version": 483, "get_version": 484, "write_to": 485, "_version": 486, "sep": 487, "versions": 488, "might": 489, "contain": 490, "cuda_version": 491, "main_cuda_version": 492, "cuda_version_str": 493, "source": 494, "tarball": 495, "required": 496, "pypi": 497, "sdist": 498, "argv": 499, "cu": 500, "neuron_version": 501, "neuron_version_str": 502, "unknown": 503, "runtime": 504, "get_requirements": 505, "package": 506, "requirements": 507, "requirements_dir": 508, "_read_requirements": 509, "resolved_requirements": 510, "line": 511, "startswith": 512, "common": 513, "cuda_major": 514, "cuda_minor": 515, "modified_requirements": 516, "req": 517, "flash": 518, "attn": 519, "12": 520, "built": 521, "unsupported": 522, "platform": 523, "please": 524, "find_cuda_init": 525, "fn": 526, "callable": 527, "object": 528, "helper": 529, "function": 530, "initialization": 531, "errors": 532, "initializes": 533, "prints": 534, "stack": 535, "trace": 536, "how": 537, "happens": 538, "_lazy_init": 539, "wrapper": 540, "nonlocal": 541, "traceback": 542, "extract_stack": 543, "initialized": 544, "format_list": 545, "llm": 546, "model": 547, "tinyllama": 548, "1b": 549, "chat": 550, "v1": 551, "max_num_seqs": 552, "max_model_len": 553, "block_size": 554, "arguments": 555, "sequence": 556, "length": 557, "targeting": 558, "device": 559, "currently": 560, "known": 561, "limitation": 562, "continuous": 563, "batching": 564, "support": 565, "transformers": 566, "neuronx": 567, "todo": 568, "liangfu": 569, "paged": 570, "attention": 571, "2048": 572, "ruff": 573, "noqa": 574, "e501": 575, "automatically": 576, "detected": 577, "aws": 578, "sdk": 579, "installed": 580, "argument": 581, "unspecified": 582, "automated": 583, "detection": 584, "explicitly": 585, "assigned": 586, "quantization": 587, "neuron_quant": 588, "override_neuron_config": 589, "cast_logits_dtype": 590, "bfloat16": 591, "tensor_parallel_size": 592, "generate": 593, "texts": 594, "prompts": 595, "requestoutput": 596, "objects": 597, "prompt": 598, "generated": 599, "information": 600, "outputs": 601, "sampling_params": 602, "50": 603, "generated_text": 604, "ngenerated": 605, "parse_args": 606, "parser": 607, "flexibleargumentparser": 608, "engineargs": 609, "add_cli_args": 610, "add_argument": 611, "help": 612, "checkpoint": 613, "pattern": 614, "shardedstateloader": 615, "default_pattern": 616, "saved": 617, "filenames": 618, "size": 619, "1024": 620, "bytes": 621, "each": 622, "safetensors": 623, "args": 624, "engine_args": 625, "from_cli_args": 626, "enable_lora": 627, "saving": 628, "model_path": 629, "is_dir": 630, "must": 631, "instance": 632, "dataclasses": 633, "asdict": 634, "prepare": 635, "mkdir": 636, "dump": 637, "worker": 638, "states": 639, "engine": 640, "being": 641, "is_v1_engine": 642, "hasattr": 643, "llm_engine": 644, "engine_core": 645, "save_sharded_state": 646, "save": 647, "file_pattern": 648, "max_size": 649, "max_file_size": 650, "v0": 651, "model_executor": 652, "metadata": 653, "listdir": 654, "splitext": 655, "pt": 656, "isdir": 657, "copytree": 658, "argparse": 659, "argumentparser": 660, "description": 661, "data": 662, "parallel": 663, "inference": 664, "ibm": 665, "research": 666, "powermoe": 667, "3b": 668, "dp": 669, "tp": 670, "tensor": 671, "node": 672, "total": 673, "nodes": 674, "rank": 675, "master": 676, "addr": 677, "ip": 678, "address": 679, "port": 680, "enforce": 681, "eager": 682, "action": 683, "store_true": 684, "mode": 685, "execution": 686, "trust": 687, "code": 688, "num": 689, "seqs": 690, "64": 691, "maximum": 692, "sequences": 693, "processed": 694, "iteration": 695, "tokens": 696, "timeout": 697, "300": 698, "seconds": 699, "before": 700, "unresponsive": 701, "process": 702, "killed": 703, "gpu": 704, "memory": 705, "utilization": 706, "float": 707, "fraction": 708, "allowed": 709, "allocate": 710, "dp_size": 711, "local_dp_rank": 712, "global_dp_rank": 713, "dp_master_ip": 714, "dp_master_port": 715, "gpus_per_dp_rank": 716, "enforce_eager": 717, "trust_remote_code": 718, "gpu_memory_utilization": 719, "vllm_dp_rank": 720, "vllm_dp_rank_local": 721, "vllm_dp_size": 722, "vllm_dp_master_ip": 723, "vllm_dp_master_port": 724, "cuda_visible_devices": 725, "inside": 726, "processes": 727, "sample": 728, "hello": 729, "my": 730, "president": 731, "united": 732, "capital": 733, "france": 734, "future": 735, "ai": 736, "100": 737, "different": 738, "usually": 739, "ranks": 740, "full": 741, "dataset": 742, "part": 743, "floor": 744, "remainder": 745, "distribute": 746, "even": 747, "groups": 748, "start": 749, "min": 750, "has": 751, "placeholder": 752, "needs": 753, "sampling": 754, "params": 755, "since": 756, "doing": 757, "every": 758, "max_tokens": 759, "demonstration": 760, "samplingparams": 761, "temperature": 762, "top_p": 763, "95": 764, "16": 765, "20": 766, "enable_expert_parallel": 767, "enumerate": 768, "break": 769, "give": 770, "engines": 771, "time": 772, "pause": 773, "processing": 774, "loops": 775, "exiting": 776, "sleep": 777, "myllm": 778, "ray": 779, "placement": 780, "constructor": 781, "sets": 782, "variables": 783, "allow": 784, "multiple": 785, "workers": 786, "share": 787, "physical": 788, "encode": 789, "bundle": 790, "indices": 791, "positional": 792, "forwarded": 793, "bundle_indices": 794, "kwargs": 795, "keyword": 796, "prevent": 797, "manipulating": 798, "top": 799, "own": 800, "pop": 801, "uses": 802, "two": 803, "instances": 804, "fit": 805, "gpus": 806, "vllm_ray_per_worker_gpus": 807, "vllm_ray_bundle_indices": 808, "map": 809, "creating": 810, "raytrainingactor": 811, "training": 812, "actor": 813, "hosts": 814, "facebook": 815, "opt": 816, "125m": 817, "hugging": 818, "face": 819, "loaded": 820, "onto": 821, "expose": 822, "ipc": 823, "handles": 824, "colocated": 825, "tensors": 826, "directly": 827, "automodelforcausallm": 828, "from_pretrained": 829, "zero": 830, "out": 831, "parameters": 832, "named_parameters": 833, "zero_": 834, "synchronize": 835, "get_device_uuid": 836, "visible": 837, "devices": 838, "platforms": 839, "current_platform": 840, "device_uuid": 841, "report_device_id": 842, "get_weight_ipc_handles": 843, "multiprocessing": 844, "reductions": 845, "reduce_tensor": 846, "hold": 847, "subset": 848, "weights": 849, "gather": 850, "actors": 851, "purposes": 852, "owns": 853, "weight": 854, "detach": 855, "time_generation": 856, "title": 857, "warmup": 858, "end": 859, "sum": 860, "token_ids": 861, "template": 862, "below": 863, "instruction": 864, "describes": 865, "task": 866, "write": 867, "response": 868, "appropriately": 869, "completes": 870, "about": 871, "without": 872, "decoding": 873, "meta": 874, "llama": 875, "13b": 876, "hf": 877, "speculation": 878, "del": 879, "gc": 880, "collect": 881, "speculative_config": 882, "accelerator": 883, "start_profile": 884, "stop_profile": 885, "add": 886, "buffer": 887, "wait": 888, "profiler": 889, "background": 890, "case": 891, "mp": 892, "finish": 893, "writing": 894, "profiling": 895, "10": 896, "modelrequestdata": 897, "namedtuple": 898, "optional": 899, "prompt_token_ids": 900, "multi_modal_data": 901, "stop_token_ids": 902, "lora_requests": 903, "lorarequest": 904, "run_voxtral": 905, "question": 906, "audio_count": 907, "mistral_common": 908, "audio": 909, "protocol": 910, "instruct": 911, "messages": 912, "audiochunk": 913, "rawaudio": 914, "textchunk": 915, "usermessage": 916, "chatcompletionrequest": 917, "tokenizers": 918, "mistral": 919, "mistraltokenizer": 920, "model_name": 921, "mistralai": 922, "voxtral": 923, "mini": 924, "2507": 925, "tokenizer": 926, "from_hf_hub": 927, "8192": 928, "limit_mm_per_prompt": 929, "config_format": 930, "load_format": 931, "tokenizer_mode": 932, "enable_chunked_prefill": 933, "text_chunk": 934, "audios": 935, "from_file": 936, "audio_assets": 937, "get_local_path": 938, "strict": 939, "audio_chunks": 940, "input_audio": 941, "from_audio": 942, "encode_chat_completion": 943, "prompt_ids": 944, "audios_and_sr": 945, "au": 946, "audio_array": 947, "sampling_rate": 948, "run_gemma3n": 949, "google": 950, "gemma": 951, "3n": 952, "e2b": 953, "max_num_batched_tokens": 954, "start_of_turn": 955, "user": 956, "audio_soft_token": 957, "end_of_turn": 958, "run_granite_speech": 959, "setting": 960, "example": 961, "somehat": 962, "than": 963, "what": 964, "optimal": 965, "granite": 966, "speech": 967, "generally": 968, "recommended": 969, "beam": 970, "readme": 971, "suggested": 972, "settings": 973, "huggingface": 974, "co": 975, "8b": 976, "max_lora_rank": 977, "specific": 978, "lora": 979, "dir": 980, "enabled": 981, "whenever": 982, "you": 983, "inputs": 984, "speech_lora_path": 985, "audio_placeholder": 986, "start_of_role": 987, "end_of_role": 988, "knowledge": 989, "cutoff": 990, "date": 991, "april": 992, "2024": 993, "ntoday": 994, "december": 995, "19": 996, "nyou": 997, "developed": 998, "helpful": 999, "assistant": 1000, "end_of_text": 1001, "run_minicpmo": 1002, "openbmb": 1003, "minicpm": 1004, "2_6": 1005, "autotokenizer": 1006, "4096": 1007, "stop_tokens": 1008, "im_end": 1009, "endoftext": 1010, "convert_tokens_to_ids": 1011, "audio_chat_template": 1012, "message": 1013, "im_start": 1014, "role": 1015, "endfor": 1016, "add_generation_prompt": 1017, "spk_bos": 1018, "spk": 1019, "spk_eos": 1020, "tts_bos": 1021, "endif": 1022, "apply_chat_template": 1023, "tokenize": 1024, "chat_template": 1025, "run_phi4mm": 1026, "phi": 1027, "multimodal": 1028, "supports": 1029, "both": 1030, "image": 1031, "snapshot_download": 1032, "microsoft": 1033, "vision": 1034, "manually": 1035, "specify": 1036, "placeholders": 1037, "audio_": 1038, "12800": 1039, "320": 1040, "run_phi4_multimodal": 1041, "revision": 1042, "refs": 1043, "pr": 1044, "70": 1045, "run_qwen2_audio": 1046, "qwen": 1047, "qwen2": 1048, "7b": 1049, "audio_in_prompt": 1050, "idx": 1051, "audio_bos": 1052, "audio_eos": 1053, "run_qwen2_5_omni": 1054, "omni": 1055, "default_system": 1056, "virtual": 1057, "human": 1058, "team": 1059, "alibaba": 1060, "capable": 1061, "perceiving": 1062, "auditory": 1063, "visual": 1064, "well": 1065, "generating": 1066, "run_ultravox": 1067, "fixie": 1068, "ultravox": 1069, "v0_5": 1070, "3_2": 1071, "run_whisper": 1072, "whisper": 1073, "input": 1074, "per": 1075, "openai": 1076, "large": 1077, "v3": 1078, "turbo": 1079, "startoftranscript": 1080, "448": 1081, "demo": 1082, "offline": 1083, "language": 1084, "models": 1085, "choices": 1086, "model_example_map": 1087, "keys": 1088, "model_type": 1089, "items": 1090, "seed": 1091, "initializing": 1092, "num_audios": 1093, "req_data": 1094, "question_per_audio_count": 1095, "disable": 1096, "modalities": 1097, "default_limits": 1098, "video": 1099, "identical": 1100, "running": 1101, "batch": 1102, "mm_data": 1103, "asset": 1104, "audio_and_sample_rate": 1105, "num_prompts": 1106, "applicable": 1107, "lora_request": 1108, "get_custom_mm_prompts": 1109, "image_urls": 1110, "image_url": 1111, "add_dataset_parser": 1112, "method": 1113, "eagle": 1114, "ngram": 1115, "eagle3": 1116, "mtp": 1117, "lookup": 1118, "chunked": 1119, "prefill": 1120, "temp": 1121, "256": 1122, "custom": 1123, "mm": 1124, "endpoint_type": 1125, "model_dir": 1126, "custom_mm_prompts": 1127, "requires": 1128, "based": 1129, "llama3": 1130, "custom_skip_chat_template": 1131, "get_samples": 1132, "add_special_tokens": 1133, "adding": 1134, "bos": 1135, "twice": 1136, "templates": 1137, "eagle_dir": 1138, "yuhuili": 1139, "num_speculative_tokens": 1140, "num_spec_tokens": 1141, "prompt_lookup_max": 1142, "prompt_lookup_min": 1143, "disable_log_stats": 1144, "16384": 1145, "disable_chunked_mm_input": 1146, "output_len": 1147, "print_output": 1148, "metrics": 1149, "get_metrics": 1150, "assertionerror": 1151, "total_num_output_tokens": 1152, "num_drafts": 1153, "num_draft_tokens": 1154, "num_accepted_tokens": 1155, "acceptance_counts": 1156, "metric": 1157, "spec_decode_num_drafts": 1158, "isinstance": 1159, "counter": 1160, "spec_decode_num_draft_tokens": 1161, "spec_decode_num_accepted_tokens": 1162, "spec_decode_num_accepted_tokens_per_pos": 1163, "vector": 1164, "pos": 1165, "values": 1166, "acceptance_length": 1167, "mean": 1168, "acceptance": 1169, "2f": 1170, "token": 1171, "position": 1172, "acceptance_rate": 1173, "run_prefill": 1174, "prefill_done": 1175, "receives": 1176, "requests": 1177, "while": 1178, "three": 1179, "receive": 1180, "kv": 1181, "cache": 1182, "do": 1183, "prefilling": 1184, "hi": 1185, "tell": 1186, "me": 1187, "very": 1188, "long": 1189, "story": 1190, "pyncclconnector": 1191, "transmit": 1192, "caches": 1193, "kv_producer": 1194, "transfer": 1195, "ktc": 1196, "kvtransferconfig": 1197, "kv_connector": 1198, "kv_role": 1199, "kv_rank": 1200, "kv_parallel_size": 1201, "a6000": 1202, "40gb": 1203, "adjust": 1204, "kv_transfer_config": 1205, "2000": 1206, "finished": 1207, "keep": 1208, "done": 1209, "otherwise": 1210, "script": 1211, "prematurely": 1212, "causing": 1213, "incomplete": 1214, "keyboardinterrupt": 1215, "stopped": 1216, "run_decode": 1217, "kv_consumer": 1218, "producer": 1219, "pipe": 1220, "waiting": 1221, "point": 1222, "transferred": 1223, "event": 1224, "prefill_process": 1225, "decode_process": 1226, "terminate": 1227, "image_data": 1228, "load_aria": 1229, "rhymes": 1230, "aria": 1231, "slow": 1232, "dtype": 1233, "fim_prefix": 1234, "img": 1235, "fim_suffix": 1236, "93532": 1237, "93653": 1238, "944": 1239, "93421": 1240, "1019": 1241, "93519": 1242, "fetch_image": 1243, "load_aya_vision": 1244, "cohereforai": 1245, "aya": 1246, "processor": 1247, "autoprocessor": 1248, "load_command_a_vision": 1249, "coherelabs": 1250, "07": 1251, "2025": 1252, "122b": 1253, "h100": 1254, "32768": 1255, "load_deepseek_vl2": 1256, "deepseek": 1257, "vl2": 1258, "tiny": 1259, "hf_overrides": 1260, "architectures": 1261, "deepseekvlv2forcausallm": 1262, "image_": 1263, "load_gemma3": 1264, "4b": 1265, "load_h2ovl": 1266, "h2oai": 1267, "h2ovl": 1268, "mississippi": 1269, "800m": 1270, "mm_processor_kwargs": 1271, "max_dynamic_patch": 1272, "stop": 1273, "eos_token_id": 1274, "load_hyperclovax_seed_vision": 1275, "naver": 1276, "hyperclovax": 1277, "_image_url": 1278, "ocr": 1279, "lens_keywords": 1280, "lens_local_keywords": 1281, "load_idefics3": 1282, "huggingfacem4": 1283, "idefics3": 1284, "confirmed": 1285, "launch": 1286, "l40": 1287, "longest_edge": 1288, "optimizations": 1289, "364": 1290, "begin_of_text": 1291, "end_of_utterance": 1292, "nassistant": 1293, "load_interns1": 1294, "internlm": 1295, "intern": 1296, "s1": 1297, "img_context": 1298, "load_internvl": 1299, "opengvlab": 1300, "internvl2": 1301, "2b": 1302, "internvl": 1303, "variants": 1304, "refer": 1305, "card": 1306, "correct": 1307, "words": 1308, "conversation": 1309, "load_llama4": 1310, "scout": 1311, "17b": 1312, "16e": 1313, "131072": 1314, "load_llava": 1315, "caution": 1316, "original": 1317, "llava": 1318, "wasn": 1319, "really": 1320, "trained": 1321, "multi": 1322, "poor": 1323, "load_llava_next": 1324, "load_llava_onevision": 1325, "onevision": 1326, "ov": 1327, "load_keye_vl": 1328, "kwai": 1329, "keye": 1330, "vl": 1331, "preview": 1332, "load_kimi_vl": 1333, "moonshotai": 1334, "kimi": 1335, "a3b": 1336, "load_mistral3": 1337, "small": 1338, "24b": 1339, "2503": 1340, "necessary": 1341, "ignore_patterns": 1342, "consolidated": 1343, "inst": 1344, "load_mllama": 1345, "11b": 1346, "img_prompt": 1347, "given": 1348, "second": 1349, "load_nvlm_d": 1350, "nvlm": 1351, "72b": 1352, "load_ovis": 1353, "aidc": 1354, "ovis2": 1355, "half": 1356, "load_pixtral_hf": 1357, "community": 1358, "pixtral": 1359, "12b": 1360, "load_phi3v": 1361, "num_crops": 1362, "kwarg": 1363, "some": 1364, "frame": 1365, "scenarios": 1366, "speaking": 1367, "larger": 1368, "results": 1369, "because": 1370, "scale": 1371, "preprocessing": 1372, "references": 1373, "docs": 1374, "formula": 1375, "after": 1376, "transform": 1377, "found": 1378, "loading": 1379, "locally": 1380, "processing_phi3_v": 1381, "l194": 1382, "load_phi4mm": 1383, "images": 1384, "vision_lora_path": 1385, "also": 1386, "passed": 1387, "dynamic_hd": 1388, "load_phi4_multimodal": 1389, "load_qwen_vl_chat": 1390, "qwenvlforconditionalgeneration": 1391, "picture": 1392, "attribute": 1393, "chatml": 1394, "generation": 1395, "utils": 1396, "qwen_generation_utils": 1397, "l265": 1398, "copied": 1399, "en": 1400, "chat_templating": 1401, "load_qwen2_vl": 1402, "qwen_vl_utils": 1403, "smart_resize": 1404, "modulenotfounderror": 1405, "resized": 1406, "functionality": 1407, "pip": 1408, "tested": 1409, "post_process_image": 1410, "width": 1411, "height": 1412, "resized_height": 1413, "resized_width": 1414, "max_pixels": 1415, "28": 1416, "resize": 1417, "load_qwen2_5_vl": 1418, "load_smolvlm": 1419, "huggingfacetb": 1420, "smolvlm2": 1421, "max_image_size": 1422, "384": 1423, "load_step3": 1424, "stepfun": 1425, "step3": 1426, "fp8": 1427, "verified": 1428, "configurations": 1429, "8xh100": 1430, "85": 1431, "reasoning_parser": 1432, "begin": 1433, "sentence": 1434, "bot": 1435, "im_patch": 1436, "eot": 1437, "think": 1438, "load_tarsier": 1439, "tarsier": 1440, "load_tarsier2": 1441, "tarsier2": 1442, "recap": 1443, "tarsier2forconditionalgeneration": 1444, "vision_start": 1445, "image_pad": 1446, "vision_end": 1447, "run_generate": 1448, "run_chat": 1449, "phi3_v": 1450, "namespace": 1451, "num_images": 1452, "invalid": 1453, "generate_random_id": 1454, "characters": 1455, "ascii_letters": 1456, "digits": 1457, "random_id": 1458, "random": 1459, "choice": 1460, "get_current_weather": 1461, "city": 1462, "state": 1463, "unit": 1464, "weather": 1465, "degrees": 1466, "partly": 1467, "cloudly": 1468, "highs": 1469, "90": 1470, "manage": 1471, "within": 1472, "create_test_prompts": 1473, "tuple": 1474, "test": 1475, "robot": 1476, "injure": 1477, "logprobs": 1478, "prompt_logprobs": 1479, "top_k": 1480, "presence_penalty": 1481, "meaning": 1482, "life": 1483, "frequency_penalty": 1484, "process_requests": 1485, "llmengine": 1486, "test_prompts": 1487, "continuously": 1488, "handle": 1489, "request_id": 1490, "has_unfinished_requests": 1491, "add_request": 1492, "request_outputs": 1493, "step": 1494, "request_output": 1495, "initialize_engine": 1496, "initialize": 1497, "from_engine_args": 1498, "up": 1499, "runs": 1500, "prithvimae": 1501, "skip_tokenizer_init": 1502, "float16": 1503, "input_data": 1504, "location_coords": 1505, "one": 1506, "structure": 1507, "float32": 1508, "pixel_values": 1509, "use_tqdm": 1510, "generate_datamodule": 1511, "datamodule": 1512, "sen1floods11nongeodatamodule": 1513, "data_root": 1514, "datamodule_config": 1515, "batch_size": 1516, "num_workers": 1517, "bands": 1518, "drop_last": 1519, "test_transform": 1520, "process_channel_group": 1521, "orig_img": 1522, "channels": 1523, "representing": 1524, "reference": 1525, "shape": 1526, "rgb": 1527, "num_channels": 1528, "valid_mask": 1529, "ones_like": 1530, "no_data_float": 1531, "rescale": 1532, "enhancing": 1533, "contrast": 1534, "max_value": 1535, "3000": 1536, "np": 1537, "percentile": 1538, "min_value": 1539, "offset": 1540, "clamp": 1541, "zeros": 1542, "read_geotiff": 1543, "file_path": 1544, "ndarray": 1545, "rasterio": 1546, "coords": 1547, "lnglat": 1548, "save_geotiff": 1549, "output_path": 1550, "band": 1551, "geotiff": 1552, "where": 1553, "dest": 1554, "_convert_np_uint8": 1555, "float_image": 1556, "numpy": 1557, "255": 1558, "astype": 1559, "uint8": 1560, "load_example": 1561, "file_paths": 1562, "std": 1563, "union": 1564, "paths": 1565, "containing": 1566, "array": 1567, "created": 1568, "imgs": 1569, "metas": 1570, "temporal_coords": 1571, "rescaling": 1572, "don": 1573, "normalize": 1574, "nodata": 1575, "moveaxis": 1576, "last": 1577, "no_data": 1578, "year": 1579, "julian_day": 1580, "datetime": 1581, "strptime": 1582, "timetuple": 1583, "tm_yday": 1584, "timestamp": 1585, "axis": 1586, "num_frames": 1587, "expand_dims": 1588, "di": 1589, "run_model": 1590, "img_size": 1591, "lightning_model": 1592, "reflect": 1593, "pad": 1594, "divisible": 1595, "original_h": 1596, "original_w": 1597, "pad_h": 1598, "pad_w": 1599, "sliding": 1600, "window": 1601, "windows": 1602, "unfold": 1603, "h1": 1604, "w1": 1605, "rearrange": 1606, "batches": 1607, "num_batches": 1608, "tensor_split": 1609, "dim": 1610, "unsqueeze": 1611, "prithvi": 1612, "eo": 1613, "v2": 1614, "300m": 1615, "tl": 1616, "sen1floods11": 1617, "pred_imgs": 1618, "apply": 1619, "standardization": 1620, "squeeze": 1621, "transpose": 1622, "aug": 1623, "no_grad": 1624, "pred": 1625, "y_hat": 1626, "argmax": 1627, "nn": 1628, "functional": 1629, "interpolate": 1630, "nearest": 1631, "concat": 1632, "patches": 1633, "cut": 1634, "padded": 1635, "area": 1636, "data_file": 1637, "output_dir": 1638, "rgb_outputs": 1639, "input_indices": 1640, "model_obj": 1641, "512": 1642, "meta_data": 1643, "10000": 1644, "convert": 1645, "red": 1646, "green": 1647, "blue": 1648, "bgr": 1649, "compress": 1650, "lzw": 1651, "pred_file": 1652, "pred_": 1653, "tiff": 1654, "rgb_orig": 1655, "nan": 1656, "img_pred": 1657, "isnan": 1658, "img_pred_file": 1659, "rgb_pred_": 1660, "name_suffix": 1661, "rgb_file": 1662, "original_rgb_": 1663, "dummylogitsprocessor": 1664, "logitsprocessor": 1665, "fake": 1666, "logit": 1667, "examples": 1668, "vllm_config": 1669, "vllmconfig": 1670, "is_pin_memory": 1671, "req_info": 1672, "is_argmax_invariant": 1673, "never": 1674, "impacts": 1675, "greedy": 1676, "update_state": 1677, "batch_update": 1678, "batchupdate": 1679, "added": 1680, "extra_args": 1681, "target_token": 1682, "removed": 1683, "moved": 1684, "unidirectional": 1685, "move": 1686, "swap": 1687, "adx": 1688, "bdx": 1689, "direct": 1690, "a_val": 1691, "b_val": 1692, "movedirectionality": 1693, "logits": 1694, "modification": 1695, "rows_list": 1696, "cols": 1697, "rows": 1698, "values_to_keep": 1699, "clone": 1700, "mask": 1701, "inf": 1702, "logits_processors": 1703, "sampling_params_list": 1704, "60": 1705, "lora_path": 1706, "define": 1707, "adapters": 1708, "max_loras": 1709, "expectation": 1710, "adapter": 1711, "ran": 1712, "128": 1713, "sql": 1714, "query": 1715, "answer": 1716, "table": 1717, "schema": 1718, "table_name_74": 1719, "icao": 1720, "varchar": 1721, "airport": 1722, "lilongwe": 1723, "international": 1724, "32003": 1725, "lora2": 1726, "controls": 1727, "loras": 1728, "numbers": 1729, "cause": 1730, "higher": 1731, "usage": 1732, "slot": 1733, "preallocated": 1734, "know": 1735, "low": 1736, "possible": 1737, "max_cpu_loras": 1738, "repo_id": 1739, "yard1": 1740, "cartype": 1741, "enum": 1742, "sedan": 1743, "suv": 1744, "truck": 1745, "coupe": 1746, "cardescription": 1747, "basemodel": 1748, "brand": 1749, "car_type": 1750, "format_output": 1751, "generate_output": 1752, "choice_output": 1753, "prompt_choice": 1754, "sampling_params_choice": 1755, "guided": 1756, "regex_output": 1757, "prompt_regex": 1758, "sampling_params_regex": 1759, "regex": 1760, "json_output": 1761, "prompt_json": 1762, "sampling_params_json": 1763, "grammar_output": 1764, "prompt_grammar": 1765, "sampling_params_grammar": 1766, "grammar": 1767, "config_buckets": 1768, "gen": 1769, "buckets": 1770, "creates": 1771, "xla": 1772, "hlo": 1773, "graphs": 1774, "neuron_context_length_buckets": 1775, "neuron_token_gen_buckets": 1776, "initialize_llm": 1777, "speculative": 1778, "openlm": 1779, "open_llama_7b": 1780, "open_llama_3b": 1781, "32": 1782, "them": 1783, "get_image": 1784, "stream": 1785, "raw": 1786, "get_vllm_mllama_model_inputs": 1787, "single_image": 1788, "mllama": 1789, "including": 1790, "put": 1791, "compose": 1792, "input_image": 1793, "has_image": 1794, "numel": 1795, "instruct_prompt": 1796, "add_instruct": 1797, "textprompt": 1798, "print_outputs": 1799, "got": 1800, "sequence_parallel_enabled": 1801, "skip_warmup": 1802, "save_sharded_checkpoint": 1803, "on_device_sampling_config": 1804, "global_topk": 1805, "dynamic": 1806, "deterministic": 1807, "batched_inputs": 1808, "batched_sample_params": 1809, "pmpt": 1810, "zip": 1811, "get_llm": 1812, "qwen3": 1813, "reranker": 1814, "runner": 1815, "pooling": 1816, "qwen3forsequenceclassification": 1817, "classifier_from_token": 1818, "yes": 1819, "is_original_qwen3_reranker": 1820, "web": 1821, "retrieve": 1822, "relevant": 1823, "passages": 1824, "queries": 1825, "china": 1826, "explain": 1827, "gravity": 1828, "documents": 1829, "beijing": 1830, "attracts": 1831, "bodies": 1832, "towards": 1833, "gives": 1834, "responsible": 1835, "movement": 1836, "planets": 1837, "around": 1838, "sun": 1839, "query_template": 1840, "document_template": 1841, "doc": 1842, "suffix": 1843, "score": 1844, "30": 1845, "set_defaults": 1846, "jinaai": 1847, "jina": 1848, "embeddings": 1849, "follow": 1850, "white": 1851, "rabbit": 1852, "english": 1853, "sigue": 1854, "al": 1855, "conejo": 1856, "blanco": 1857, "spanish": 1858, "suis": 1859, "le": 1860, "lapin": 1861, "blanc": 1862, "french": 1863, "跟着白兔走": 1864, "chinese": 1865, "اتبع": 1866, "الأرنب": 1867, "الأبيض": 1868, "arabic": 1869, "folge": 1870, "dem": 1871, "weißen": 1872, "kaninchen": 1873, "german": 1874, "embedding": 1875, "vars": 1876, "embeddingrequestoutputs": 1877, "embed": 1878, "pooling_params": 1879, "poolingparams": 1880, "dimensions": 1881, "embeds": 1882, "embeds_trimmed": 1883, "nembeddings": 1884, "clarity": 1885, "sharded_state": 1886, "validation": 1887, "world": 1888, "parameter": 1889, "load": 1890, "nrunning": 1891, "completion": 1892, "display": 1893, "load_prompt": 1894, "cases": 1895, "various": 1896, "lengths": 1897, "qianwen": 1898, "res": 1899, "oss": 1900, "cn": 1901, "aliyuncs": 1902, "1m": 1903, "64k": 1904, "200k": 1905, "600k": 1906, "repetition_penalty": 1907, "05": 1908, "detokenize": 1909, "1048576": 1910, "caching": 1911, "baseline": 1912, "regular_llm": 1913, "enable_prefix_caching": 1914, "generating_prompts": 1915, "regular_generated_texts": 1916, "destroy": 1917, "free": 1918, "cleanup_dist_env_and_memory": 1919, "prefix_cached_llm": 1920, "shared": 1921, "computed": 1922, "cached_generated_texts": 1923, "compare": 1924, "speedup": 1925, "generated_same": 1926, "answers": 1927, "gauge": 1928, "histogram": 1929, "bucket_le": 1930, "run_aria": 1931, "questions": 1932, "modality": 1933, "equivalent": 1934, "oom": 1935, "run_aya_vision": 1936, "crop_to_patches": 1937, "start_of_turn_token": 1938, "user_token": 1939, "end_of_turn_token": 1940, "chatbot_token": 1941, "run_blip2": 1942, "blip": 1943, "inaccurate": 1944, "salesforce": 1945, "blip2": 1946, "discussions": 1947, "15": 1948, "64ff02f3f8cf9e4f5b038262": 1949, "run_chameleon": 1950, "chameleon": 1951, "run_command_a_vision": 1952, "img_patch": 1953, "run_deepseek_vl2": 1954, "run_florence2": 1955, "florence": 1956, "isotr0py": 1957, "more_detailed_caption": 1958, "run_fuyu": 1959, "adept": 1960, "fuyu": 1961, "run_gemma3": 1962, "do_pan_and_scan": 1963, "start_of_image": 1964, "image_soft_token": 1965, "run_glm4v": 1966, "zai": 1967, "org": 1968, "glm": 1969, "4v": 1970, "9b": 1971, "glm4vforcausallm": 1972, "begin_of_image": 1973, "end_of_image": 1974, "151329": 1975, "151336": 1976, "151338": 1977, "run_glm4_1v": 1978, "1v": 1979, "thinking": 1980, "shortest_edge": 1981, "12544": 1982, "47040000": 1983, "fps": 1984, "begin_of_video": 1985, "end_of_video": 1986, "gmask": 1987, "sop": 1988, "run_h2ovl": 1989, "run_hyperclovax_seed_vision": 1990, "raster": 1991, "order": 1992, "word": 1993, "feels": 1994, "unnatural": 1995, "reading": 1996, "follows": 1997, "clova": 1998, "bigshane": 1999, "entity": 2000, "names": 2001, "iphone": 2002, "quads": 2003, "21": 2004, "92": 2005, "run_idefics3": 2006, "run_interns1": 2007, "run_internvl": 2008, "internvl3": 2009, "token_id": 2010, "run_keye_vl": 2011, "video_pad": 2012, "run_kimi_vl": 2013, "im_user": 2014, "im_middle": 2015, "media_start": 2016, "media_content": 2017, "media_pad": 2018, "media_end": 2019, "im_assistant": 2020, "run_llama4": 2021, "run_llava": 2022, "run_llava_next": 2023, "run_llava_next_video": 2024, "next": 2025, "run_llava_onevision": 2026, "run_mantis": 2027, "llama3_template": 2028, "start_header_id": 2029, "end_header_id": 2030, "eot_id": 2031, "tiger": 2032, "lab": 2033, "mantis": 2034, "siglip": 2035, "mantisforconditionalgeneration": 2036, "128009": 2037, "run_minicpmv_base": 2038, "want": 2039, "audio_language": 2040, "official": 2041, "doesn": 2042, "work": 2043, "yet": 2044, "fork": 2045, "now": 2046, "details": 2047, "pull": 2048, "4087": 2049, "issuecomment": 2050, "2250397630": 2051, "hwwwh": 2052, "2_5": 2053, "o2": 2054, "eos_id": 2055, "modality_placeholder": 2056, "run_minicpmv": 2057, "run_mistral3": 2058, "run_mllama": 2059, "lower": 2060, "run_molmo": 2061, "allenai": 2062, "molmo": 2063, "0924": 2064, "run_nemotron_vl": 2065, "nemotron": 2066, "nano": 2067, "run_nvlm_d": 2068, "run_ovis": 2069, "run_paligemma": 2070, "paligemma": 2071, "special": 2072, "vqa": 2073, "caption": 2074, "mix": 2075, "224": 2076, "run_paligemma2": 2077, "paligemma2": 2078, "ft": 2079, "docci": 2080, "run_phi3v": 2081, "image_1": 2082, "5120": 2083, "run_pixtral_hf": 2084, "6144": 2085, "run_qwen_vl": 2086, "run_qwen2_vl": 2087, "min_pixels": 2088, "1280": 2089, "run_qwen2_5_vl": 2090, "vision_bos": 2091, "vision_eos": 2092, "run_skyworkr1v": 2093, "skywork": 2094, "r1v": 2095, "38b": 2096, "skyworkr1v": 2097, "run_smolvlm": 2098, "run_step3": 2099, "run_tarsier": 2100, "run_tarsier2": 2101, "get_multi_modal_input": 2102, "convert_image_mode": 2103, "imageasset": 2104, "cherry_blossom": 2105, "pil_image": 2106, "img_questions": 2107, "describe": 2108, "detail": 2109, "taken": 2110, "videoasset": 2111, "baby_reading": 2112, "np_ndarrays": 2113, "vid_questions": 2114, "why": 2115, "funny": 2116, "glm4_1v": 2117, "msg": 2118, "apply_image_repeat": 2119, "image_repeat_prob": 2120, "repeats": 2121, "provided": 2122, "probability": 2123, "simulate": 2124, "hit": 2125, "miss": 2126, "preprocessor": 2127, "no_yes": 2128, "probs": 2129, "cur_image": 2130, "repeat": 2131, "modify": 2132, "pixel": 2133, "new_val": 2134, "putpixel": 2135, "time_counter": 2136, "start_time": 2137, "yield": 2138, "elapsed_time": 2139, "frames": 2140, "prob": 2141, "simulates": 2142, "ratio": 2143, "modal": 2144, "call": 2145, "mm_input": 2146, "mm_processor_cache_gb": 2147, "disable_mm_processor_cache": 2148, "flag": 2149, "times": 2150, "just": 2151, "hijack": 2152, "use_different_prompt_per_request": 2153, "specified": 2154, "time_generate": 2155, "spmd": 2156, "llm_args": 2157, "5b": 2158, "use_spmd": 2159, "vllm_xla_use_spmd": 2160, "hardcode": 2161, "chips": 2162, "calling": 2163, "xr": 2164, "global_runtime_device_count": 2165, "beforeing": 2166, "init": 2167, "torch_xla": 2168, "mess": 2169, "distributed": 2170, "num_kv_heads": 2171, "ahead": 2172, "real": 2173, "workloads": 2174, "enforace_eager": 2175, "outside": 2176, "across": 2177, "updated": 2178, "randint": 2179, "500": 2180, "ignore_eos": 2181, "home": 2182, "ubuntu": 2183, "model_hf": 2184, "70b": 2185, "draft": 2186, "enable_eagle_speculation": 2187, "enable_fused_speculation": 2188, "matching": 2189, "16120": 2190, "profilecontext": 2191, "prompt_len": 2192, "modes": 2193, "num_steps": 2194, "until": 2195, "complete": 2196, "complete_num_requests_per_step": 2197, "save_chrome_traces_folder": 2198, "get_dtype": 2199, "compute_request_output_lengths": 2200, "step_requests": 2201, "outputlen_numreqs_map": 2202, "step_request": 2203, "honoured": 2204, "96": 2205, "31": 2206, "submitted": 2207, "profile": 2208, "ith": 2209, "dictionary": 2210, "ol_nr": 2211, "num_reqs_assigned": 2212, "sanity": 2213, "assignments": 2214, "output_length": 2215, "num_requests_at_step": 2216, "reversed": 2217, "determined": 2218, "participate": 2219, "beyond": 2220, "num_reqs_unassigned_at_step": 2221, "checks": 2222, "assignment": 2223, "steps": 2224, "least": 2225, "ol": 2226, "determine_requests_per_step": 2227, "fewer": 2228, "big": 2229, "num_engine_steps": 2230, "implies": 2231, "equal": 2232, "expected": 2233, "positive": 2234, "instead": 2235, "dropping": 2236, "num_running_requests": 2237, "often": 2238, "useful": 2239, "run_profile": 2240, "csv_output": 2241, "key": 2242, "requests_per_step": 2243, "num_steps_to_profile": 2244, "max_output_len": 2245, "basis": 2246, "scheduler_config": 2247, "model_config": 2248, "chosen": 2249, "therefore": 2250, "choose": 2251, "smaller": 2252, "increase": 2253, "batched": 2254, "add_requests": 2255, "get_output_len_generator": 2256, "generator": 2257, "num_reqs": 2258, "output_len_generator": 2259, "get_tokenizer": 2260, "vocab_size": 2261, "tolist": 2262, "seq": 2263, "abort_requests": 2264, "abort_request": 2265, "warm": 2266, "layerwise_profile": 2267, "prefill_prof": 2268, "decode_profs": 2269, "tqdm": 2270, "num_running_seqs": 2271, "scheduler": 2272, "get_num_unfinished_seq_groups": 2273, "decode_prof": 2274, "decode_results_list": 2275, "prof": 2276, "prefill_results": 2277, "has_decode": 2278, "line_width": 2279, "80": 2280, "print_model_table": 2281, "summary": 2282, "print_summary_table": 2283, "csv_filename_base": 2284, "endswith": 2285, "csv": 2286, "export_model_stats_table_csv": 2287, "_prefill_model_table": 2288, "export_summary_stats_table_csv": 2289, "_prefill_summary_table": 2290, "_decode_model_table": 2291, "_decode_summary_table": 2292, "cuda_devices": 2293, "get_device_properties": 2294, "dev_idx": 2295, "device_count": 2296, "json_dict": 2297, "python_version": 2298, "torch_version": 2299, "torch_cuda_version": 2300, "convert_stats_to_dict": 2301, "dr": 2302, "decode_": 2303, "json_output_file": 2304, "indent": 2305, "export_chrome_trace": 2306, "traces": 2307, "decode_1": 2308, "etc": 2309, "folder": 2310, "offline_inference": 2311, "neuralmagic": 2312, "8196": 2313, "llama31": 2314, "run_num_steps": 2315, "tools": 2316, "analyze": 2317, "terminal": 2318, "ascii": 2319, "tables": 2320, "print_layerwise_table": 2321, "phase": 2322, "matplotlib": 2323, "stacked": 2324, "bar": 2325, "charts": 2326, "visualize_layerwise_profile": 2327, "profile_breakdown": 2328, "plot": 2329, "pct_cuda_time": 2330, "formatter_class": 2331, "rawtexthelpformatter": 2332, "export": 2333, "chrome": 2334, "prompt_len_default": 2335, "batch_size_default": 2336, "subparsers": 2337, "add_subparsers": 2338, "cmd": 2339, "run_num_steps_parser": 2340, "add_parser": 2341, "variation": 2342, "invocations": 2343, "1st": 2344, "2nd": 2345, "run_to_completion_parser": 2346, "run_to_completion": 2347, "exhausts": 2348, "respectively": 2349, "tack": 2350, "inspect": 2351, "signature": 2352, "prompttype": 2353, "implicit": 2354, "detailed_caption": 2355, "stop_sign": 2356, "explicit": 2357, "encoder": 2358, "decoder": 2359, "encoder_prompt": 2360, "shown": 2361, "decoder_prompt": 2362, "audioasset": 2363, "mary_had_lamb": 2364, "winning_call": 2365, "skip_special_tokens": 2366, "duration": 2367, "rps": 2368, "holds": 2369, "id": 2370, "model_id": 2371, "encoder_prompts": 2372, "decoder_prompts": 2373, "get_bart_config": 2374, "bart": 2375, "cnn": 2376, "another": 2377, "get_mbart_config": 2378, "mbart": 2379, "ro": 2380, "suitable": 2381, "romanian": 2382, "translation": 2383, "quick": 2384, "brown": 2385, "fox": 2386, "jumps": 2387, "over": 2388, "lazy": 2389, "dog": 2390, "today": 2391, "mbartforconditionalgeneration": 2392, "create_all_prompt_types": 2393, "encoder_prompts_raw": 2394, "decoder_prompts_raw": 2395, "generates": 2396, "diverse": 2397, "types": 2398, "generic": 2399, "text_prompt_raw": 2400, "text_prompt": 2401, "tokens_prompt": 2402, "tokensprompt": 2403, "decoder_tokens_prompt": 2404, "single_prompt_examples": 2405, "explicit_pair_examples": 2406, "explicitencoderdecoderprompt": 2407, "zipped_prompt_list": 2408, "zip_enc_dec_prompts": 2409, "create_sampling_params": 2410, "min_tokens": 2411, "formats": 2412, "model_key": 2413, "model_getters": 2414, "config_getter": 2415, "get_tokenizer_group": 2416, "textquery": 2417, "typeddict": 2418, "literal": 2419, "imagequery": 2420, "textimagequery": 2421, "textimagesquery": 2422, "scoremultimodalparam": 2423, "run_e5_v": 2424, "nsummary": 2425, "above": 2426, "royokong": 2427, "e5": 2428, "run_vlm2vec": 2429, "everyday": 2430, "matches": 2431, "day": 2432, "looks": 2433, "similar": 2434, "represent": 2435, "following": 2436, "vlm2vec": 2437, "run_jinavl_reranker": 2438, "m0": 2439, "3136": 2440, "602112": 2441, "get_query": 2442, "querymodality": 2443, "sitting": 2444, "grass": 2445, "upload": 2446, "wikimedia": 2447, "wikipedia": 2448, "commons": 2449, "thumb": 2450, "47": 2451, "american_eskimo_dog": 2452, "jpg": 2453, "360px": 2454, "standing": 2455, "snow": 2456, "b6": 2457, "felis_catus": 2458, "cat_on_snow": 2459, "179px": 2460, "slm": 2461, "markdown": 2462, "githubusercontent": 2463, "handelsblatt": 2464, "png": 2465, "paper": 2466, "run_encode": 2467, "run_score": 2468, "tasks": 2469, "scoring": 2470, "get_args": 2471, "init_tokenizer_and_llm": 2472, "transformers_model": 2473, "embedding_layer": 2474, "get_input_embeddings": 2475, "enable_prompt_embeds": 2476, "get_prompt_embeds": 2477, "pretrainedtokenizer": 2478, "return_tensors": 2479, "prompt_embeds": 2480, "single_prompt_inference": 2481, "batch_prompt_inference": 2482, "chats": 2483, "longest": 2484, "during": 2485, "bigger": 2486, "moon": 2487, "prompt_embeds_list": 2488, "create_llm": 2489, "rope_theta": 2490, "1000000": 2491, "original_max_position_embeddings": 2492, "factor": 2493, "yarn": 2494, "extend": 2495, "rope_scaling": 2496, "rope_type": 2497, "6b": 2498, "run_llm_chat": 2499, "assist": 2500, "get_generation_time": 2501, "end_time": 2502, "apc": 2503, "lmsys": 2504, "longchat": 2505, "16k": 2506, "querying": 2507, "age": 2508, "john": 2509, "doe": 2510, "long_prompt": 2511, "zack": 2512, "faster": 2513, "avoids": 2514, "computing": 2515, "again": 2516, "print_prompts_and_outputs": 2517, "dummy": 2518, "noutputs": 2519, "sense": 2520, "auto": 2521, "collective_rpc": 2522, "update_config": 2523, "load_config": 2524, "reload": 2525, "inplace": 2526, "reload_weights": 2527, "run_simple_demo": 2528, "image_pil": 2529, "run_advanced_demo": 2530, "max_img_per_msg": 2531, "max_tokens_per_img": 2532, "url_1": 2533, "datasets": 2534, "patrickvonplaten": 2535, "random_img": 2536, "resolve": 2537, "yosemite": 2538, "url_2": 2539, "picsum": 2540, "photos": 2541, "url_3": 2542, "nature": 2543, "simple": 2544, "advanced": 2545, "usa": 2546, "lora_repo": 2547, "test_configs": 2548, "qlora": 2549, "arxiv": 2550, "abs": 2551, "2305": 2552, "14314": 2553, "qlora_inference_example": 2554, "huggyllama": 2555, "bitsandbytes": 2556, "timdettmers": 2557, "flan": 2558, "awq_inference_with_lora_example": 2559, "thebloke": 2560, "awq": 2561, "jashing": 2562, "colorist": 2563, "gptq_inference_with_lora_example": 2564, "gptq": 2565, "test_config": 2566, "clean": 2567, "empty_cache": 2568, "stateless_init_process_group": 2569, "master_address": 2570, "master_port": 2571, "world_size": 2572, "provides": 2573, "statelessprocessgroup": 2574, "considering": 2575, "global": 2576, "plane": 2577, "communication": 2578, "nccl": 2579, "external": 2580, "train": 2581, "device_communicators": 2582, "pynccl": 2583, "pyncclcommunicator": 2584, "pg": 2585, "host": 2586, "workerextension": 2587, "inherit": 2588, "defining": 2589, "matter": 2590, "underlying": 2591, "way": 2592, "separate": 2593, "qualified": 2594, "worker_extension_cls": 2595, "init_weight_update_group": 2596, "rank_offset": 2597, "parallel_state": 2598, "get_world_group": 2599, "model_update_group": 2600, "update_weight": 2601, "dtype_name": 2602, "getattr": 2603, "broadcast": 2604, "current_stream": 2605, "model_runner": 2606, "load_weights": 2607, "check_weights_changed": 2608, "weights_updated": 2609, "allclose": 2610, "zeros_like": 2611, "colocateworkerextension": 2612, "colocate": 2613, "update_weights_from_ipc_handles": 2614, "ipc_handles": 2615, "device_id": 2616, "func": 2617, "list_args": 2618, "change": 2619, "from_2_way_softmax": 2620, "causal_lm": 2621, "seq_cls_model": 2622, "lm_head_weights": 2623, "lm_head": 2624, "false_id": 2625, "true_id": 2626, "score_weight": 2627, "copy_": 2628, "bias": 2629, "no_post_processing": 2630, "converting": 2631, "classifier_from_tokens": 2632, "use_pad_token": 2633, "method_map": 2634, "num_labels": 2635, "device_map": 2636, "automodelforsequenceclassification": 2637, "ignore_mismatched_sizes": 2638, "defaults": 2639, "pad_token": 2640, "config": 2641, "pad_token_id": 2642, "save_pretrained": 2643, "forcausallm": 2644, "forsequenceclassification": 2645, "baai": 2646, "bge": 2647, "classifier": 2648, "whether": 2649, "cls": 2650, "converted": 2651, "server": 2652, "xp": 2653, "start_server": 2654, "9012": 2655, "f841": 2656, "dummy_prompt_token_ids": 2657, "input_len": 2658, "dummy_prompts": 2659, "perf_counter": 2660, "latency": 2661, "warming": 2662, "warmup_latencies": 2663, "num_iters_warmup": 2664, "desc": 2665, "iterations": 2666, "average": 2667, "4f": 2668, "profile_dir": 2669, "profile_result_dir": 2670, "tracing": 2671, "trace_detached": 2672, "localhost": 2673, "delay_ms": 2674, "duration_ms": 2675, "profile_latencies": 2676, "num_iters": 2677, "benchmark": 2678, "till": 2679, "iters": 2680, "result": 2681, "pytorch": 2682, "visualized": 2683, "ui": 2684, "perfetto": 2685, "tensorboard": 2686, "cloud": 2687, "performance": 2688, "vm": 2689, "queryresult": 2690, "get_mixed_modalities_query": 2691, "recited": 2692, "get_use_audio_in_video_query": 2693, "baby": 2694, "say": 2695, "get_audio": 2696, "16000": 2697, "vllm_use_v1": 2698, "use_audio_in_video": 2699, "get_multi_audios_query": 2700, "clips": 2701, "query_result": 2702, "query_map": 2703, 